{"timestamp": 1744751457.3545542, "articles": [{"title": "A Colossal Squid Has Been Filmed in the Deep Sea for the First Time", "url": "https://www.scientificamerican.com/article/a-colossal-squid-has-been-filmed-in-the-deep-sea-for-the-first-time/", "source": "Scientific American", "category": "science", "published": "Tue, 15 Apr 2025 20:00:00 +0000", "summary": "<p>A colossal squid was filmed for the first time in its natural habitat near the South Sandwich Islands during a recent expedition, and it turned out to be a baby</p>", "full_content": "", "text": "This is the first confirmed live observation of the colossal squid ( Mesonychoteuthis hamiltoni ) in its natural habitat, taken by the remotely operated vehicle SuBastian on March 9 during an Ocean Census flagship expedition in the remote South Sandwich Islands in the South Atlantic Ocean. This squid is a baby about one foot long.\n\nA colossal squid was filmed for the first time in its natural habitat near the South Sandwich Islands during a recent expedition, and it turned out to be a baby\n\nA faintly fluttering specter, at first hardly visible among bits of marine snow falling in slow motion, emerged from the deep-sapphire void. The pilot of the underwater robot brought the creature to the center of the frame, giving scientists on a ship at the ocean’s surface a good view of the strange life-form. Its mostly transparent, speckled dome was topped with fins that busily flapped like tiny wings, and its tentacles were drawn up underneath it, toward its glowing red undercarriage.\n\nThere was little fanfare—just a few minutes of quiet, almost reverent observation. But the encounter, 100 years in the making, marked the first time a colossal squid (Mesonychoteuthis hamiltoni) had ever been caught on film in its natural habitat.\n\n“This is one of the planet’s true giants, living in one of our most pristine marine ecosystems,” says Kat Bolstad, an associate professor at the Auckland University of Technology in New Zealand, who helped independently identify the creature from the footage. “It’s a source of fascination and wonder, and it also plays a huge role in Antarctic food webs.”\n\nOn supporting science journalism\n\nIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\n\nScientists onboard the Schmidt Ocean Institute’s research vessel Falkor (too) saw the colossal squid about 2,000 feet beneath the surface near the remote, uninhabited South Sandwich Islands in the South Atlantic Ocean. These leviathans can grow to about 23 feet long and can weigh more than 1,000 pounds—shorter, but much stockier, than the giant squid (Architeuthis dux), which grows to about 43 feet long and 600 pounds. The colossal squid that was captured on film was just a baby, however, measuring only about a foot in length.\n\n“It’s incredible that we can leverage the power of the taxonomic community through R/V Falkor (too) telepresence while we are out at sea,” said the expedition’s chief scientist, Michelle Taylor of the University of Essex in England, in a recent press release. “The Ocean Census international science network is proud to work together with the Schmidt Ocean Institute to accelerate species discovery and expand our knowledge of ocean life, live online with the world’s science community.”\n\nThough people have known about the existence of colossal squids for a century, the animals had mainly been found among the stomach contents of whales and seabirds, successfully evading human eyes in their natural habitat.\n\n“Much of our scientific and filming gear is noisy and bright, so squid will be aware of our equipment long before we know they’re there—and they will stay well away,” Bolstad says. “The deep sea is a vast 3D space, and looking for specific animals there is tricky, especially when they are probably actively trying to avoid us!” Scientists still don’t know much about what these reticent creatures feed on, how long they live or what their reproductive traits are.\n\nThe sighting came alongside many other strange encounters, including a grenadier fish with parasitic pigtails, a piñatalike anemone, a carnivorous sponge that resembled a dandelion and Seussian corals. In a region so remote and underexplored, it’s no surprise that weird and wonderful discoveries emerge—and each new find offers valuable insight into a world that science is still just beginning to understand.\n\n“Observing the colossal squid gives us the chance both to learn about this remote place,” Bolstad says, “and to share the excitement of such discoveries with people who may not think about the deep sea very often—even though it makes up 95 percent of the living space on Earth and plays an enormous role in regulating our climate.”", "image": "https://static.scientificamerican.com/dam/m/44c7363cb7362942/original/colossal-squid-baby.jpg?m=1744747529.868&w=1200", "images": ["https://static.scientificamerican.com/dam/m/44c7363cb7362942/original/colossal-squid-baby.jpg?m=1744747529.868&w=1200", "https://static.scientificamerican.com/dam/m/44c7363cb7362942/original/colossal-squid-baby.jpg?m=1744747529.868&w=600"], "authors": ["Ashley Balzer Vigil", "Andrea Thompson"]}, {"title": "Google adds Veo 2 video generation to Gemini app", "url": "https://arstechnica.com/gadgets/2025/04/googles-veo-2-generative-video-creator-is-coming-to-gemini/", "source": "Ars Technica", "category": "technology", "published": "Tue, 15 Apr 2025 19:43:28 +0000", "summary": "Video generation starts rolling out today for Gemini Advanced subscribers.", "full_content": "", "text": "Google has announced that yet another AI model is coming to Gemini, but this time, it's more than a chatbot. The company's Veo 2 video generator is rolling out to the Gemini app and website, giving paying customers a chance to create short video clips with Google's allegedly state-of-the-art video model.\n\nVeo 2 works like other video generators, including OpenAI's Sora—you input text describing the video you want, and a Google data center churns through tokens until it has an animation. Google claims that Veo 2 was designed to have a solid grasp of real-world physics, particularly the way humans move. Google's examples do look good, but presumably that's why they were chosen.\n\nPrompt: Aerial shot of a grassy cliff onto a sandy beach where waves crash against the shore, a prominent sea stack rises from the ocean near the beach, bathed in the warm, golden light of either sunrise or sunset, capturing the serene beauty of the Pacific coastline.\n\nVeo 2 will be available in the model drop-down, but Google does note it's still considering ways to integrate this feature and that the location could therefore change. However, it's probably not there at all just yet. Google is starting the rollout today, but it could take several weeks before all Gemini Advanced subscribers get access to Veo 2. Gemini features can take a surprisingly long time to arrive for the bulk of users—for example, it took about a month for Google to make Gemini Live video available to everyone after announcing its release.\n\nWhen Veo 2 does pop up in your Gemini app, you can provide it with as much detail as you want, which Google says will ensure you have fine control over the eventual video. Veo 2 is currently limited to 8 seconds of 720p video, which you can download as a standard MP4 file. Video generation uses even more processing than your average generative AI feature, so Google has implemented a monthly limit. However, it hasn't confirmed what that limit is, saying only that users will be notified as they approach it.", "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/veo-2-1152x648.jpg", "images": ["https://cdn.arstechnica.net/wp-content/uploads/2025/04/veo-2-640x361.jpg", "https://cdn.arstechnica.net/wp-content/themes/ars-v9/public/images/firework-loader.75ab30.gif", "https://cdn.arstechnica.net/wp-content/uploads/2025/02/AV4.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/veo-2-1152x648.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-1832935833-768x432.jpg"], "authors": []}, {"title": "White House calls NPR and PBS a “grift,” will ask Congress to rescind funding", "url": "https://arstechnica.com/tech-policy/2025/04/white-house-aims-to-defund-npr-and-pbs-in-move-slammed-as-cultural-sabotage/", "source": "Ars Technica", "category": "technology", "published": "Tue, 15 Apr 2025 19:31:36 +0000", "summary": "Markey: Cutting NPR and PBS \"is not budget discipline, it's cultural sabotage.\"", "full_content": "", "text": "The Trump White House is proposing to eliminate most federal funding for National Public Radio (NPR) and the Public Broadcasting Service (PBS) and issued a statement yesterday alleging that NPR and PBS \"spread radical, woke propaganda disguised as 'news.'\"\n\n\"The NPR, PBS grift has ripped us off for too long,\" the White House statement said.\n\nWhite House budget director Russ Vought drafted a memo for a rescission plan that would eliminate funding already approved by Congress, according to multiple news reports. This includes $1.1 billion for the Corporation for Public Broadcasting (CPB), or about two years' worth of funding for the nonprofit group that provides money to public broadcasting stations.\n\nThe Vought memo accused CPB of a \"lengthy history of anti-conservative bias,\" according to The New York Post. The memo also reportedly proposes an $8.3 billion cut for USAID.\n\nThe $1.1 billion accounts for most of the federal money that goes to CPB. \"The Trump administration isn't planning to ask Congress to claw back about $100 million allocated for emergency communications,\" The New York Times wrote. The NYT wrote that CPB \"is 'forward-funded' two years to insulate it from political maneuvering, and a sizable chunk of the money for 2025 has already been paid out to public broadcasters in the United States.\"\n\nIn March, Trump said in a Truth Social post that NPR and PBS are \"two horrible and completely biased platforms\" that \"should be DEFUNDED by Congress, IMMEDIATELY.\"\n\nIn a statement provided to Ars today, PBS CEO Paula Kerger said that \"the effort underway to get Congress to rescind public media funding would disrupt the essential service PBS and local member stations provide to the American people. There's nothing more American than PBS, and our work is only possible because of the bipartisan support we have always received from Congress... Without PBS member stations, Americans will lose unique local programming and emergency services in times of crisis.\"", "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/npr-headquarters-1152x648-1744744308.jpg", "images": ["https://cdn.arstechnica.net/wp-content/uploads/2016/05/j.brodkin-11_2.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/npr-headquarters-640x426.jpg", "https://cdn.arstechnica.net/wp-content/themes/ars-v9/public/images/firework-loader.75ab30.gif", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-1832935833-768x432.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/npr-headquarters-1152x648-1744744308.jpg"], "authors": []}, {"title": "Harvard’s Stand against Trump Interference Cheered by Scientists despite Risk to Research", "url": "https://www.scientificamerican.com/article/harvards-stand-against-trump-interference-cheered-by-scientists-despite-risk/", "source": "Scientific American", "category": "science", "published": "Tue, 15 Apr 2025 19:20:00 +0000", "summary": "<p>The Trump administration has frozen billions in funding to the world&rsquo;s richest university after Harvard refused to acquiesce to its demands</p>", "full_content": "", "text": "The Trump administration has frozen billions in funding to the world’s richest university after Harvard refused to acquiesce to its demands\n\nAfter Harvard University pushed back against the Trump administration’s attempts to force the school to comply with sweeping political demands yesterday, the White House announced it would freeze more than $2.2 billion in Harvard’s funding—and threatened the university’s tax-exempt status.\n\nWhat Happened at Harvard\n\nThe Trump administration sent a letter to Harvard on Friday that accused the university of what it claimed were civil rights violations and antisemitism and demanded unprecedented changes to the institution’s hiring and admissions practices. In response, lawyers representing Harvard sent a letter to Trump administration lawyers in which they said the university refused to comply with the demands and described them as going “beyond the lawful authority of this or any administration.”\n\nOn supporting science journalism\n\nIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\n\nThe funding freeze jeopardizes vital research in public health and medicine, among other subjects. And Harvard-affiliated hospitals could bear the brunt of these effects. Nevertheless, Harvard’s pushback has garnered widespread praise from faculty members, scientists and public figures, including former president Barack Obama.\n\nHow Scientists Are Reacting\n\nSome Harvard scientists expressed enthusiastic support for the institution’s response. “I’ve been waiting for a major university to take a stand like this. I am thrilled that mine did,” wrote Jeremy Faust, an assistant professor at Harvard Medical School and an emergency physician at Brigham and Women’s Hospital, in his newsletter Inside Medicine.\n\nWhen Scientific American reached out to Faust for comment, he said he couldn’t speak for Harvard. “What I can say on behalf of myself is that I had been seriously considering submitting my first federal grant proposals until November [2024]. After the election, I abandoned those plans,” he says. “Any thought of soldering on was quickly put aside in January and February, when we witnessed the unprecedented viewpoint-driven censorship across [the Department of Health and Human Services], with certain disfavored views being literally punished with the sudden pulling of promised grant funding along ideological lines.”\n\nOther Harvard scientists also praised the university’s recent actions. “I certainly don’t speak for the community, but I suspect that a lot of my colleagues are quite excited that Harvard has a spine,” said George Church, a professor of genetics at Harvard Medical School, who leads synthetic biology at the Wyss Institute, to STAT.\n\nScientists at other institutions chimed in with support on social media. “First time you’ll hear this Yalie say: let’s go Harvard. Seriously: Yale stand up and lead,” wrote Gregg Gonsalves, an associate professor of epidemiology at the Yale School of Public Health, in a post on Bluesky. Gonsalves was among about 900 faculty members who signed a letter to Yale’s president that called on the school to defend academic freedom.\n\nStanford University’s president and provost also issued a statement in support of Harvard’s actions. “Harvard’s objections to the letter it received are rooted in the American tradition of liberty, a tradition essential to our country’s universities, and worth defending,” read the statement, which was published in the Stanford Daily. “America’s universities are a source of great national strength, creating knowledge and driving innovation and economic growth,” it continued. “This strength has been built on government investment but not government control.”", "image": "https://static.scientificamerican.com/dam/m/7fe74b139fd98df3/original/Harvard_Gates_2.jpg?m=1744744948.082&w=1200", "images": ["https://static.scientificamerican.com/dam/m/7fe74b139fd98df3/original/Harvard_Gates_2.jpg?m=1744744948.082&w=600", "https://static.scientificamerican.com/dam/m/7fe74b139fd98df3/original/Harvard_Gates_2.jpg?m=1744744948.082&w=1200"], "authors": ["Tanya Lewis", "Dean Visser"]}, {"title": "The physics of bowling strike after strike", "url": "https://arstechnica.com/science/2025/04/the-physics-of-bowling-strike-after-strike/", "source": "Ars Technica", "category": "technology", "published": "Tue, 15 Apr 2025 19:00:56 +0000", "summary": "New model uses 6 differential equations relating to a rotating rigid body for best strike conditions.", "full_content": "", "text": "More than 45 million people in the US are fans of bowling, with national competitions awarding millions of dollars. Bowlers usually rely on instinct and experience, earned through lots and lots of practice, to boost their strike percentage. A team of physicists has come up with a mathematical model to better predict ball trajectories, outlined in a new paper published in the journal AIP Advances. The resulting equations take into account such factors as the composition and resulting pattern of the oil used on bowling lanes, as well as the inevitable asymmetries of bowling balls and player variability.\n\nThe authors already had a strong interest in bowling. Three are regular bowlers and quite skilled at the sport; a fourth, Curtis Hooper of Longborough University in the UK, is a coach for Team England at the European Youth Championships. Hooper has been studying the physics of bowling for several years, including an analysis of the 2017 Weber Cup, as well as papers devising mathematical models for the application of lane conditioners and oil patterns in bowling.\n\nThe calculations involved in such research are very complicated because there are so many variables that can affect a ball's trajectory after being thrown. Case in point: the thin layer of oil that is applied to bowling lanes, which Hooper found can vary widely in volume and shape among different venues, plus the lack of uniformity in applying the layer, which creates an uneven friction surface.\n\nPer the authors, most research to date has relied on statistically analyzing empirical data, such as a 2018 report by the US Bowling Congress that looked at data generated by 37 bowlers. (Hooper relied on ball-tracking data for his 2017 Weber Cup analysis.) A 2009 analysis showed that the optimal location for the ball to strike the headpin is about 6 centimeters off-center, while the optimal entry angle for the ball to hit is about 6 degrees. However, such an approach struggles to account for the inevitable player variability. No bowler hits their target 100 percent of the time, and per Hooper et al., while the best professionals can come within 0.1 degrees from the optimal launch angle, this slight variation can nonetheless result in a difference of several centimeters down-lane.", "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/bowling2-1152x648-1744384355.jpg", "images": ["https://cdn.arstechnica.net/wp-content/themes/ars-v9/public/images/firework-loader.75ab30.gif", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/bowling1-640x590.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/bowling2-640x442.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/bowling2-1152x648-1744384355.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-1832935833-768x432.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2018/08/arspic300.jpg"], "authors": []}, {"title": "4chan has been down since Monday night after “pretty comprehensive own”", "url": "https://arstechnica.com/information-technology/2025/04/internet-cesspit-4chan-apparently-hacked-mostly-unreachable-since-monday-night/", "source": "Ars Technica", "category": "technology", "published": "Tue, 15 Apr 2025 18:43:29 +0000", "summary": "Early info is unreliable, but the site has been mostly unavailable for hours.", "full_content": "", "text": "Infamous Internet imageboard and wretched hive of scum and villainy 4chan was apparently hacked at some point Monday evening and remains mostly unreachable as of this writing. DownDetector showed reports of outages spiking at about 10:07 pm Eastern time on Monday, and they've remained elevated since.\n\nPosters at Soyjack Party, a rival imageboard that began as a 4chan offshoot, claimed responsibility for the hack. But as with all posts on these intensely insular boards, it's difficult to separate fact from fiction. The thread shows screenshots of what appear to be 4chan's PHP admin interface, among other screenshots, that suggest extensive access to 4chan's databases of posts and users.\n\nSecurity researcher Kevin Beaumont described the hack as \"a pretty comprehensive own\" that included \"SQL databases, source, and shell access.\" 404Media reports that the site used an outdated version of PHP that could have been used to gain access, including the phpMyAdmin tool, a common attack vector that is frequently patched for security vulnerabilities. Ars staffers pointed to the presence of long-deprecated and removed functions like mysql_real_escape_string in the screenshots as possible signs of an old, unpatched PHP version.\n\nIn other words, there's a possibility that the hackers have gained pretty deep access to all of 4chan's data, including site source code and user data.\n\nSome widely shared posts on social media sites have made as-yet-unsubstantiated claims about data leaks from the outage, including the presence of users' real names, IP addresses, and .edu and .gov email addresses used for registration. Without knowing more about the extent of the hack, reports of the site's ultimate \"death\" are probably also premature.", "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/4chan-logo-1152x648.png", "images": ["https://cdn.arstechnica.net/wp-content/uploads/2025/04/4chan-logo-640x360.png", "https://cdn.arstechnica.net/wp-content/uploads/2016/05/a.cunningham-45-1.jpg", "https://cdn.arstechnica.net/wp-content/themes/ars-v9/public/images/firework-loader.75ab30.gif", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/4chan-logo-1152x648.png", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-1832935833-768x432.jpg"], "authors": []}, {"title": "Netflix plans to bring streaming into the $1 trillion club by 2030", "url": "https://arstechnica.com/gadgets/2025/04/netflix-plans-to-bring-streaming-into-the-1-trillion-club-by-2030/", "source": "Ars Technica", "category": "technology", "published": "Tue, 15 Apr 2025 18:32:31 +0000", "summary": "Netflix aims to double its revenue over the next five years, WSJ reports.", "full_content": "", "text": "Netflix plans to reach a market capitalization of $1 trillion by 2030, The Wall Street Journal (WSJ) reported this week, citing anonymous people who attended an “annual business review meeting” that Netflix held in March. Netflix's current market capitalization is nearly $400 billion.\n\nNetflix is reportedly partnering its market cap goals with plans to double revenue within the same time frame. For 2024, Netflix reported $39 billion in revenue, meaning the company aims to raise its annual revenue to $78 billion in five years.\n\nCompared to the prior five years, Netflix’s revenue grew 93.5 percent from 2019 ($20.16 billion) to 2024. However, that time period represented a different market, one where streaming subscriber counts were rising rapidly, and Netflix faced less competition than it does today. However, Netflix's 2030 revenue goals are also dependent on its advertising business, something Netflix lacked in 2019.\n\nWSJ, citing anonymous people who attended Netflix’s March meeting, reported that Netflix plans to make $9 billion in ad sales by 2030. Netflix hasn’t disclosed ad revenue since launching its ad subscription tier in November 2022. However, eMarketer has estimated that Netflix will make over $2 billion in US ad revenue this year.\n\nNetflix will try growing its ad business by getting more people to subscribe to its ad tier, which is its cheapest subscription option. But additional methods for growing ad revenue will also be critical over the next five years, including showing more live events. Live events force all viewers, including those with ad-free subscriptions, to watch commercials.\n\nNetflix will also look to take more control over ad revenue tied to its platform by using proprietary ad technology. Since launching its ad tier, Netflix has largely relied on Microsoft for ad tech. Netflix is supposed to release its own technology, a supply-side platform and ad server called The Netflix Ads Suite, this month. The company has discussed potentially introducing new ad formats, like pause ads, while keeping ad loads at four minutes per hour with its tech. However, US President Donald Trump's wavering tariff plans have stirred uncertainty for advertisers and are expected to hurt the ad market in the coming months and years.", "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/AAAAQf7DFctJ-jMyIjhhpNvwjoz9g2VPcPC9KILeVGu0WyAsKDsROqK0HyUNlRzR0hNfc5fNvsLXKBbMlP5exvuOwYKukVvsKKsHS9aM4NqpxGT2u3os2uCsG2gllMBVn0EZXYoU2KAWyXLeBMvLyzBAyP5OBJw-1152x648.jpg", "images": ["https://cdn.arstechnica.net/wp-content/uploads/2025/04/AAAAQf7DFctJ-jMyIjhhpNvwjoz9g2VPcPC9KILeVGu0WyAsKDsROqK0HyUNlRzR0hNfc5fNvsLXKBbMlP5exvuOwYKukVvsKKsHS9aM4NqpxGT2u3os2uCsG2gllMBVn0EZXYoU2KAWyXLeBMvLyzBAyP5OBJw-1152x648.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2021/09/scharon-harding-headshot.jpg", "https://cdn.arstechnica.net/wp-content/themes/ars-v9/public/images/firework-loader.75ab30.gif", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-1832935833-768x432.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/AAAAQf7DFctJ-jMyIjhhpNvwjoz9g2VPcPC9KILeVGu0WyAsKDsROqK0HyUNlRzR0hNfc5fNvsLXKBbMlP5exvuOwYKukVvsKKsHS9aM4NqpxGT2u3os2uCsG2gllMBVn0EZXYoU2KAWyXLeBMvLyzBAyP5OBJw-640x361.jpg"], "authors": []}, {"title": "Tech Use Associated with Reduced Dementia Risk in Older Adults", "url": "https://www.scientificamerican.com/article/tech-use-associated-with-reduced-dementia-risk-in-older-adults/", "source": "Scientific American", "category": "science", "published": "Tue, 15 Apr 2025 18:30:00 +0000", "summary": "<p>Smartphone and computer use hasn&rsquo;t put today&rsquo;s older adults at increased risk of cognitive decline</p>", "full_content": "", "text": "Screens are steadily taking over more and more of our life, leading some researchers to worry about the effect of long-term use on older adults’ brain. It has been suggested that this might lead to so-called digital dementia—that depending on digital technology throughout our life might detract from cognitive functioning in our later years.\n\nBut new research indicates this hypothesis doesn’t appear to be true, at least for the generation of adults who first routinely used smartphones, computers and the Internet—and who are now reaching the age when cognitive impairment often starts to appear. In a paper published on Monday in Nature Human Behaviour, researchers analyzed 57 studies of digital technology use and cognitive function in more than 400,000 older adults across the world. They found that people in the “digital pioneer” generation who engaged more with digital technology did not have higher rates of cognitive impairment. In fact, technology use was associated with lower rates of cognitive decline. Yet the nature of the apparent relationship between these factors remains unclear.\n\nOne reason some researchers worried about “digital dementia” was previous research that linked television viewing, a passive activity, with negative outcomes such as an increased risk of Alzheimer’s disease. On the surface, most computer or smartphone screentime might seem similarly passive, says the new paper’s co-author Michael Scullin, a neuroscience researcher at Baylor University. But “for this group of middle-aged and older adults, [phones and computers] have been used for mentally stimulating activities and for social connections,” such as solving puzzles, engaging with the news, chatting with friends, or using reminders and alarms to help with daily activities.\n\nOn supporting science journalism\n\nIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\n\nScullin and his co-author Jared Benge, a neuropsychologist at the University of Texas at Austin, gathered large studies that tracked cognitive and other health outcomes—and that also included information on participants’ everyday technology use. The authors identified 57 studies and rated them for the quality of their evidence, based on sample size, methods, and more. In analyzing the studies’ results, the researchers found technology use pointed to a reduced risk of cognitive decline. This outcome could not be solely explained by demographic, socioeconomic, health or other lifestyle factors in isolation.\n\nA possibility that using digital technology could potentially help stave off cognitive decline aligns with the cognitive reserve theory, or the idea that the brain can work around damage from neurodegenerative diseases by finding alternate ways to complete tasks. This theory, based on a 1988 study in which individuals with no dementia symptoms were found to have Alzheimer’s-like changes in their brain, holds that engaging with complex mental activities may lead to better cognitive well-being in older age.\n\nBut it’s also possible that the reverse is true: instead of technology use staving off dementia, early experiences of cognitive decline could decrease older adults’ likelihood of engaging with technology in the first place. Or an unknown third variable could be affecting both technology use and cognitive decline. “Correlation is not causation,” Benge stresses.\n\n“I was not especially surprised by the results, but I was surprised by how clear and consistent they were,” says neuroscientist Sam Gilbert of University College London, who wasn’t involved with the study. “This study provides a robust challenge to the pervasive fears about ‘digital dementia’ and highlights the potential of technology as a tool for cognitive enrichment,” says Chiara Scarampi, a neuroscientist at the University of Geneva, who also was not involved with the study.\n\n“‘Digital dementia’ has always felt like a catchy but overstated concept to me,” she adds. “Cognitive offloading—using tools like reminders or GPS—is not inherently harmful. In fact, it can free up cognitive resources for more complex tasks.”", "image": "https://static.scientificamerican.com/dam/m/65b1dcc1ff3b22c/original/older_person_using_smartphone_at_table.jpg?m=1744735465.31&w=1200", "images": ["https://static.scientificamerican.com/dam/m/65b1dcc1ff3b22c/original/older_person_using_smartphone_at_table.jpg?m=1744735465.31&w=600", "https://static.scientificamerican.com/dam/m/65b1dcc1ff3b22c/original/older_person_using_smartphone_at_table.jpg?m=1744735465.31&w=1200"], "authors": ["Payal Dhar", "Allison Parshall"]}, {"title": "Here’s how a satellite ended up as a ghostly apparition on Google Earth", "url": "https://arstechnica.com/science/2025/04/heres-how-a-satellite-ended-up-as-a-ghostly-apparition-on-google-earth/", "source": "Ars Technica", "category": "technology", "published": "Tue, 15 Apr 2025 17:24:40 +0000", "summary": "Zoom in over rural North Texas for a spacey surprise.", "full_content": "", "text": "Dig deep on Google Earth and you'll inevitably find a surprise or two. Maybe you're looking at far-flung islands in the middle of an ocean or checking in on something closer to home.\n\nA few years ago, online sleuths found an image of a B-2 stealth bomber in flight over Missouri. The aircraft is smeared in the image because it was in motion, while the farm fields below appear as crisp as any other view on Google Earth.\n\nThere's something else that now appears on Google Earth. Zoom in over rural North Texas, and you'll find a satellite. It appears five times in different colors, each projected over wooded bottomlands in a remote wildlife refuge about 60 miles (100 kilometers) north of Dallas.\n\nSatellites in low-Earth orbit soar up to 40 times higher than a B-2 bomber and travel about 30 times faster. But there are more than 9,300 active satellites currently in orbit, and thousands more space debris objects, compared to 19 operational B-2 bombers in the Air Force's inventory.\n\nRelative velocity\n\nSomeone first shared Google Earth's satellite capture last week on Reddit. The identity of the satellite hasn't been confirmed, but its appearance is similar to that of a SpaceX Starlink satellite, specifically a Starlink V2 Mini, with two solar panels spanning some 100 feet (30 meters) end to end. There are more than 7,000 Starlink satellites in space today, more than all other satellite constellations combined, so it wouldn't be surprising that the first Google Earth capture of another spacecraft in orbit would show a Starlink.\n\nGoogle Earth data indicates that the image was taken on November 30, 2024, by a high-resolution Pleiades observation satellite owned by Airbus. Another Reddit user suggested the satellite could be a Chinese Earth-imaging spacecraft named Ziyuan 3-02, which was flying in the same area as the Pleiades satellite at the time.", "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/starlinks_google_earth-1152x648.jpg", "images": ["https://cdn.arstechnica.net/wp-content/uploads/2025/04/starlinks_google_earth-640x417.jpg", "https://cdn.arstechnica.net/wp-content/themes/ars-v9/public/images/firework-loader.75ab30.gif", "https://cdn.arstechnica.net/wp-content/uploads/2023/06/clarkstephenheadshot-md.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/starlinks_google_earth-1152x648.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-1832935833-768x432.jpg"], "authors": []}, {"title": "Nvidia nudges mainstream gaming PCs forward with RTX 5060 series, starting at $299", "url": "https://arstechnica.com/gadgets/2025/04/nvidia-nudges-mainstream-gaming-pcs-forward-with-rtx-5060-series-starting-at-299/", "source": "Ars Technica", "category": "technology", "published": "Tue, 15 Apr 2025 16:36:13 +0000", "summary": "RTX 5060 includes 8GB for $299; RTX 5060 Ti has 8GB or 16GB for $379 and $429.", "full_content": "", "text": "Nvidia is rounding out its GeForce RTX 50-series graphics cards today with the official announcement of the mainstream RTX 5060 series. The company is announcing three new GPUs today: The 5060 Ti will launch on April 16 in both 8GB and 16GB variations, for $379 and $429, respectively. The regular RTX 5060 will follow at some point in May for the same $299 MSRP as the last-generation RTX 4060. It is also sticking with 8GB of RAM.\n\nObviously, it remains to be seen whether the company and its partners can actually stock these cards at these prices. GPUs from the top-tier RTX 5090 to the mainstream RTX 5070 have been difficult to impossible to buy at their announced MSRPs. And it's not just Nvidia's problem or a high-end problem—AMD's Radeon RX 9070 series GPUs have also been hard to buy, as have Intel's Arc B580 and B570 cards.\n\nThe new graphics cards' specs essentially match numbers that have been floating around for a couple of months now. Both models include modest increases in the number of CUDA cores compared to the last-generation 4060 and 4060 Ti models, with the same amount of RAM and the same 128-bit memory interface. But an upgrade to GDDR7 instead of GDDR6 provides a healthy bump to memory bandwidth and is probably also partially responsible for an increase in peak power consumption. The 4060 Ti in particular was memory bandwidth-constrained at higher resolutions, so hopefully some extra bandwidth will make it a better choice for a decent 1440p gaming PC.\n\nRTX 5060 Ti RTX 4060 Ti RTX 5060 RTX 4060 RTX 5050 (leaked) RTX 3050 CUDA Cores 4,608 4,352 3,840 3,072 2,560 2,560 Boost Clock 2,572 MHz 2,535 MHz 2,497 MHz 2,460 MHz Unknown 1,777 MHz Memory Bus Width 128-bit 128-bit 128-bit 128-bit 128-bit 128-bit Memory bandwidth 448GB/s 288GB/s 448GB/s 272GB/s Unknown 224GB/s Memory size 8GB or 16GB GDDR7 8GB or 16GB GDDR6 8GB GDDR7 8GB GDDR6 8GB GDDR6 8GB GDDR6 TGP 180 W 160 W 145 W 115 W 130 W 130 W\n\nNvidia's xx60 tier generally ends up being its most popular, going off of the statistics provided by the Steam Hardware Survey; mobile and desktop xx60 models from various generations account for seven of Steam's 10 most-used GPUs, led by the RTX 3060 and 4060. That means that new xx60 GPUs are an important baseline for PC gaming performance.", "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/PNY-RTX-5060-Ti-16GB-STD-Dual-Fan-exploded-1152x648.jpg", "images": ["https://cdn.arstechnica.net/wp-content/uploads/2025/04/rtx-5060-01-1024x555.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/PNY-RTX-5060-Ti-16GB-STD-Dual-Fan-exploded-1152x648.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2016/05/a.cunningham-45-1.jpg", "https://cdn.arstechnica.net/wp-content/themes/ars-v9/public/images/firework-loader.75ab30.gif", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/PNY-RTX-5060-Ti-16GB-STD-Dual-Fan-exploded-640x427.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/rtx-5060-02-1024x547.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/rtx-5060-04-1024x564.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/rtx-5060-03-1024x569.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-1832935833-768x432.jpg"], "authors": []}, {"title": "Trump Administration puts $2.2 billion of Harvard’s research money on hold", "url": "https://arstechnica.com/science/2025/04/harvard-says-feds-research-funding-demands-amount-to-a-takeover/", "source": "Ars Technica", "category": "technology", "published": "Tue, 15 Apr 2025 16:20:51 +0000", "summary": "Harvard won't give government a say in faculty hiring; Trump threatens its tax status.", "full_content": "", "text": "The Trump administration has been using federal research funding as a cudgel. The government has blocked billions of dollars in research funds and threatened to put a hold on even more in order to compel universities to adopt what it presents as essential reforms. In the case of Columbia University, that includes changes in the leadership of individual academic departments.\n\nOn Friday, the government sent a list of demands that it presented as necessary to \"maintain Harvard’s financial relationship with the federal government.\" On Monday, Harvard responded that accepting these demands would \"allow itself to be taken over by the federal government.\" The university also changed its home page into an extensive tribute to the research that would be eliminated if the funds were withheld.\n\nThe reprisals against Harvard began almost immediately. By the end of Monday, the Trump administration put $2.2 billion of Harvard's research funding on hold. And on Tuesday, Trump himself made threats against the university's tax exempt status.\n\nDiversity, but only the right kind\n\nHarvard posted the letter it received from federal officials, listing their demands. Some of it is what you expect, given the Trump administration's interests. The admissions and hiring departments would be required to drop all diversity efforts, with data on faculty and students to be handed over to the federal government for auditing. As at other institutions, there are also some demands presented as efforts against antisemitism, such as the defunding of pro-Palestinian groups. More generally, it demands that university officials \"prevent admitting students hostile to the American values and institutions.\"\n\nThere are also a bunch of basic culture war items, such as a demand for a mask ban, and a ban on \"de-platforming\" speakers on campus. In addition, the government wants the university to screen all faculty hires for plagiarism issues, which is what caused Harvard's former president to resign after she gave testimony to Congress. Any violation of these updated conduct codes by a non-citizen would require an immediate report to the Department of Homeland Security and State Department, presumably so they can prepare to deport them.", "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-1832935833-1152x648.jpg", "images": ["https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-1832935833-1152x648.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2016/05/j.timmer-5.jpg", "https://cdn.arstechnica.net/wp-content/themes/ars-v9/public/images/firework-loader.75ab30.gif", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/Screenshot-2025-04-14-at-4.15.15%E2%80%AFPM.png", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-1832935833-640x427.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-1832935833-768x432.jpg"], "authors": []}, {"title": "Android phones will soon reboot themselves after sitting unused for 3 days", "url": "https://arstechnica.com/gadgets/2025/04/android-phones-will-soon-reboot-themselves-after-sitting-unused-for-3-days/", "source": "Ars Technica", "category": "technology", "published": "Tue, 15 Apr 2025 16:00:00 +0000", "summary": "The latest Google update will make your phone more secure if you don't touch it", "full_content": "", "text": "A silent update rolling out to virtually all Android devices will make your phone more secure, and all you have to do is not touch it for a few days. The new feature implements auto-restart of a locked device, which will make your personal data harder to extract. It's coming as part of a Google Play Services update, though, so there's nothing you can do to speed along the process.\n\nGoogle is preparing to release a new update to Play Services (v25.14), which brings a raft of tweaks and improvements. First spotted by 9to5Google, the update was officially released on April 14, but as with all Play Services updates, it could take a week or more to reach all devices. When 25.14 arrives, Android devices will see a few minor improvements, including prettier settings screens, improved connection with cars and watches, and content previews when using Quick Share.\n\nMost importantly, Play Services 25.14 adds a feature that Google describes thusly: \"With this feature, your device automatically restarts if locked for 3 consecutive days.\"\n\nThis is similar to a feature known as Inactivity Reboot that Apple added to the iPhone in iOS 18.1. This actually caused some annoyance among law enforcement officials who believed they had suspects' phones stored in a readable state, only to find they were rebooting and becoming harder to access due to this feature.", "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/Android-locked-1152x648.jpg", "images": ["https://cdn.arstechnica.net/wp-content/uploads/2025/04/Android-locked-1152x648.jpg", "https://cdn.arstechnica.net/wp-content/themes/ars-v9/public/images/firework-loader.75ab30.gif", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/Android-locked-640x360.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/02/AV4.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-1832935833-768x432.jpg"], "authors": []}, {"title": "Offshore Wind Power Poses Only Limited Risk to Whales, Government Watchdog Report Finds", "url": "https://www.scientificamerican.com/article/offshore-wind-power-poses-only-limited-risk-to-whales-government-watchdog/", "source": "Scientific American", "category": "science", "published": "Tue, 15 Apr 2025 15:30:00 +0000", "summary": "<p>Republicans asked Congress&rsquo;s watchdog to scrutinize offshore wind power&rsquo;s effect on commercial fishing, marine navigation and wildlife, but the resulting report undermines anti-wind-power talking points</p>", "full_content": "", "text": "Republicans asked Congress’s watchdog to scrutinize offshore wind power’s effect on commercial fishing, marine navigation and wildlife, but the resulting report undermines anti-wind-power talking points\n\nCLIMATEWIRE | Two years ago, Republican lawmakers asked Congress’ watchdog to scrutinize offshore wind's impact on commercial fishing, marine navigation and wildlife.\n\nWhat they got was a report recommending the government improve coordination with Native American tribes and open a new office overseeing offshore wind development in the Northeast.\n\nThe report released Monday by the Government Accountability Office was requested by a quartet of anti-wind lawmakers in 2023, who had accused the Biden administration of overlooking the impact of wind development on national security, commercial fishing and wildlife. They have sought to paint offshore wind as a whale killer that snarls shipping lanes and hamstrings national security.\n\nOn supporting science journalism\n\nIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\n\nThe 68-page investigation, which comes amid President Donald Trump's pledge to shut down the industry, paints a different picture.\n\nIt makes a nod to concerns of fishermen that their input is received too late in the federal permitting process, recommending that regulators take additional steps to demonstrate how they incorporate fishermen’s feedback into their decisions. And it reprises federal research on turbine’s impact to marine radar — noting how wind development can impair navigation and efforts to address the issue.\n\nBut it also reflects the scientific consensus that wind poses limited risks to whales, contrary to the popular GOP talking point.\n\n\"Wind development could bring jobs and investment to communities. At the same time, it could disrupt commercial fishing to varying degrees,\" GAO wrote. \"Turbines could also affect radar system performance, alter search and rescue methods, and alter historic and cultural landscapes.\"\n\nThe result is a series of modest reforms needed to fill gaps in the government's oversight of offshore wind, such as opening an office in the Northeast to help the Bureau of Ocean Energy Management and the Bureau of Safety and Environmental Enforcement better oversee the industry and address local concerns. Both bureaus are divisions of the Interior Department charged with overseeing offshore wind development.\n\nNotably, much of the report is dedicated to a topic that Republicans did not ask GAO to investigate: coordination with Native American tribes. GAO called BOEM's engagement with tribes \"inconsistent,\" writing that the bureau \"has not consistently engaged in meaningful consultation with Tribes during the offshore wind energy development process as called for in directives and guidance for tribal consultation.\"\n\nWind opponents and advocates alike said GAO's findings validated their long held positions. The report confirmed that issues raised by offshore wind opponents “weren’t just hypothetical concerns, they were real and serious,” said Rep. Jeff Van Drew, a New Jersey Republican who was among the lawmakers to request the study.\n\nHillary Bright, president of the pro-wind group Turn Forward, said the findings showed “offshore wind development should move forward with robust community engagement and strong environmental protections.”\n\nThe comments reflect the high stakes of the moment. Trump signed an executive order on his first day back in the White House ordering federal agencies to halt permits for new offshore wind projects and directing them to review existing ones.\n\nFive projects already had entered varying degrees of construction when Trump came into office and have continued to move ahead. In recent weeks, wind opponents have ratcheted up calls for the president to stop them.\n\nRep. Chris Smith, a New Jersey Republican, wrote to Interior Secretary Doug Burgum last month warning that the department needed to stop Equinor from embarking on offshore construction of its Empire Wind project off New York. When the Norwegian company moved ahead with the initial phases of construction, it prompted the leader of a Long Island commercial fishing group to pen an op-ed in the New York Post last week warning of a “man-made disaster.”\n\nThe conservative activist Steven Milloy wrote in the Daily Caller that the Interior Department needed to follow through on Trump’s pledge to halt offshore wind development completely.\n\n“President Trump campaigned on saving the whales and the rest of us from offshore wind and followed up with an Executive order,” Milloy wrote.\n\n“Someone,” he concluded, “has got to see to their execution.”\n\nThe GAO report notes that offshore wind poses limited risk to whales, addressing a series of longstanding arguments raised by wind opponents. The radar used by offshore wind developers to probe the ocean floor to identify turbine locations is less powerful than those employed by the oil and gas industry.\n\nWhales and other marine wildlife are also likely to vacate an area when developers begin pile driving foundations into the seabed. And noise generated by the turbines once they enter operation is likely indistinguishable to wildlife from other sounds in the ocean, GAO said.\n\nBut it also provided fodder for offshore wind opponents who seized on the report’s finding that turbines reduce the effectiveness of marine radar in military and marine applications. Smith, the New Jersey congressman, said it provided the “scientific justification” for Trump’s wind pause.\n\nThe GAO’s findings aren’t new. They were based in part on a pair of reports conducted during the Biden administration, including a 2024 study by the Energy Department and a 2022 study by the National Academies of Sciences, Engineering and Medicine. And GAO also noted the steps that agencies have taken to reduce the risks posed by wind farms. The Defense Department, for instance, has developed processes like exclusion areas and has agreements with wind developers to curtail production if needed, GAO noted.\n\nGAO interviewed 23 people with expertise in fisheries, marine wildlife, oceanography, marine transportation and radar, among others. One expert told GAO that large shipping vessels could have difficulty avoiding turbines in the event of a mechanical failure and that smaller ships emerging from a wind farm might not be visible to larger ships radar.\n\nThe report also noted that offshore wind could have negative impacts on commercial fishermen, who have long argued that their input is considered too late in the process to have a meaningful impact on a project’s design and location.\n\nThe federal government engages in a lengthy permitting process, first accepting public comment on areas it is considering for wind development, then again when an area is leased for wind development and once again when a project submits its proposed design.\n\n“Stakeholders remain concerned that BOEM has not adequately considered or addressed the concerns of the commercial fishing industry,” GAO wrote, adding, “it is not clear how BOEM ensures that these stakeholders are consistently included in the process and informed of BOEM’s efforts to incorporate input from the industry when establishing lease areas.”\n\nThe Interior Department and BOEM did not respond to a request for comment.\n\nBut in a letter to GAO, BOEM Deputy Director Walter Cruickshank said it concurred with GAO’s recommendations, though he said the watchdog’s proposal for a new office in the Northeast would depend on whether offshore wind development aligns with the Trump administration’s priorities.\n\nReprinted from E&E News with permission from POLITICO, LLC. Copyright 2025. E&E News provides essential news for energy and environment professionals.", "image": "https://static.scientificamerican.com/dam/m/1f66151c2e398a2c/original/Block_Island_wind_farm.jpg?m=1744729726.094&w=1200", "images": ["https://static.scientificamerican.com/dam/m/1f66151c2e398a2c/original/Block_Island_wind_farm.jpg?m=1744729726.094&w=1200", "https://static.scientificamerican.com/dam/m/1f66151c2e398a2c/original/Block_Island_wind_farm.jpg?m=1744729726.094&w=600"], "authors": ["Benjamin Storrow", "E E News"]}, {"title": "ISPs and robocallers love the FCC plan to “delete” as many rules as possible", "url": "https://arstechnica.com/tech-policy/2025/04/isps-and-robocallers-love-the-fcc-plan-to-delete-as-many-rules-as-possible/", "source": "Ars Technica", "category": "technology", "published": "Tue, 15 Apr 2025 15:06:08 +0000", "summary": "FCC's \"Delete, Delete, Delete\" docket is filled with requests to eliminate rules.", "full_content": "", "text": "Industry groups have submitted deregulatory wishlists for the Federal Communications Commission's \"Delete, Delete, Delete\" initiative that aims to eliminate as many regulations as possible.\n\nBroadband providers that want fewer telecom regulations and debt collectors opposed to robocall rules were among those submitting comments to the FCC in response to Chairman Brendan Carr's request for public input. The Carr-led FCC last month issued a public notice asking for help with \"identifying FCC rules for the purpose of alleviating unnecessary regulatory burdens.\"\n\nThe FCC said it opened the official proceeding—which is titled \"Delete, Delete, Delete\"—because \"President Trump has called on administrative agencies to unleash prosperity through deregulation and ensure that they are efficiently delivering great results for the American people.\" Initial comments were due on Friday, and there is an April 28 deadline for reply comments.\n\nThe docket has comments submitted by AT&T, Verizon, and the top lobbying groups for the cable, telecom, and mobile broadband industries. Starlink-owner SpaceX and Amazon's Kuiper submitted wishlists for satellite deregulation. The FCC also received deregulatory requests from prison phone company Securus, TV broadcasters, and multiple groups that want less strict robocall rules.\n\nCarr has long been an advocate for removing broadband and telecom regulations, so rule-cutting requests submitted by Internet providers and their lobby groups probably have a good chance of being implemented. But Carr isn't against regulations of all types: he has controversially sought to increase enforcement of content policies against news stations accused of bias against conservatives and Trump and has supported many actions against robocallers.\n\nCarr has already started making it easier for telcos to turn off old copper phone and DSL networks, as we reported last month. AT&T and Verizon want additional rule-cutting when it comes to maintaining old networks, and it appears that Delete, Delete, Delete could achieve that and a lot more.", "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/chainsaw-1152x648-1744727753.jpg", "images": ["https://cdn.arstechnica.net/wp-content/uploads/2016/05/j.brodkin-11_2.jpg", "https://cdn.arstechnica.net/wp-content/themes/ars-v9/public/images/firework-loader.75ab30.gif", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/chainsaw-640x360.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/chainsaw-1152x648-1744727753.jpg", "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-1832935833-768x432.jpg"], "authors": []}, {"title": "How and Where Is Nuclear Waste Stored in the U.S.?", "url": "https://www.scientificamerican.com/article/how-and-where-is-nuclear-waste-stored-in-the-u-s/", "source": "Scientific American", "category": "science", "published": "Tue, 15 Apr 2025 14:00:00 +0000", "summary": "<p>The decades-long struggle to find a permanent place to dispose of nuclear waste in the U.S. will continue, probably for many years to come</p>", "full_content": "", "text": "Storage site for high level radioactive waste at the Hanford Reservation. The site once produced plutonium for nuclear weapons.\n\nThe decades-long struggle to find a permanent place to dispose of nuclear waste in the U.S. will continue, probably for many years to come\n\nThe following essay is reprinted with permission from The Conversation, an online publication covering the latest research.\n\nAround the U.S., about 90,000 tons of nuclear waste is stored at over 100 sites in 39 states, in a range of different structures and containers.\n\nFor decades, the nation has been trying to send it all to one secure location.\n\nOn supporting science journalism\n\nIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\n\nA 1987 federal law named Yucca Mountain, in Nevada, as a permanent disposal site for nuclear waste – but political and legal challenges led to construction delays. Work on the site had barely started before Congress ended the project’s funding altogether in 2011.\n\nThe 94 nuclear reactors currently operating at 54 power plants continue to generate more radioactive waste. Public and commercial interest in nuclear power is rising because of concerns regarding emissions from fossil fuel power plants and the possibility of new applications for smaller-scale nuclear plants to power data centers and manufacturing. This renewed interest gives new urgency to the effort to find a place to put the waste.\n\nIn March 2025, the U.S. Supreme Court heard arguments related to the effort to find a temporary storage location for the nation’s nuclear waste – a ruling is expected by late June. No matter the outcome, the decades-long struggle to find a permanent place to dispose of nuclear waste will probably continue for many years to come.\n\nI am a scholar who specializes in corrosion; one focus of my work has been containing nuclear waste during temporary storage and permanent disposal. There are generally two forms of significantly radioactive waste in the U.S.: waste from making nuclear weapons during the Cold War, and waste from generating electricity at nuclear power plants. There are also small amounts of other radioactive waste, such as that associated with medical treatments.\n\nWaste from weapons manufacturing\n\nRemnants of the chemical processing of radioactive material needed to manufacture nuclear weapons, often called “defense waste,” will eventually be melted along with glass, with the resulting material poured into stainless steel containers. These canisters are 10 feet tall and 2 feet in diameter, weighing approximately 5,000 pounds when filled.\n\nFor now, though, most of it is stored in underground steel tanks, primarily at Hanford, Washington, and Savannah River, South Carolina, key sites in U.S. nuclear weapons development. At Savannah River, some of the waste has already been processed with glass, but much of it remains untreated.\n\nAt both of those locations, some of the radioactive waste has already leaked into the soilbeneath the tanks, though officials have said there is no danger to human health. Most of the current efforts to contain the waste focus on protecting the tanks from corrosion and cracking to prevent further leakage.\n\nWaste from electricity generation\n\nThe vast majority of nuclear waste in the U.S. is spent nuclear fuel from commercial nuclear power plants.\n\nBefore it is used, nuclear fuel exists as uranium oxide pellets that are sealed within zirconium tubes, which are themselves bundled together. These bundles of fuel rods are about 12 to 16 feet long and about 5 to 8 inches in diameter. In a nuclear reactor, the fission reactions fueled by the uranium in those rods emit heat that is used to create hot water or steam to drive turbines and generate electricity.\n\nAfter about three to five years, the fission reactions in a given bundle of fuel slow down significantly, even though the material remains highly radioactive. The spent fuel bundles are removed from the reactor and moved elsewhere on the power plant’s property, where they are placed into a massive pool of water to cool them down.\n\nAfter about five years, the fuel bundles are removed, dried and sealed in welded stainless steel canisters. These canisters are still radioactive and thermally hot, so they are stored outdoors in concrete vaults that sit on concrete pads, also on the power plant’s property. These vaults have vents to ensure air flows past the canisters to continue cooling them.\n\nAs of December 2024, there were over 315,000 bundles of spent nuclear fuel rods in the U.S., and over 3,800 dry storage casks in concrete vaults above ground, located at current and former power plants across the country.\n\nEven reactors that have been decommissioned and demolished still have concrete vaults storing radioactive waste, which must be secured and maintained by the power company that owned the nuclear plant.\n\nSalt spray from the ocean can corrode waste containers at nearby nuclear waste storage sites, like this one at the San Onofre Nuclear Generating Station in California. Allen J. Schaben/Los Angeles Times via Getty Images\n\nThe threat of water\n\nOne threat to these storage methods is corrosion.\n\nBecause they need water to both transfer nuclear energy into electricity and to cool the reactor, nuclear power plants are always located alongside sources of water.\n\nIn the U.S., nine are within two miles of the ocean, which poses a particular threat to the waste containers. As waves break on the coastline, saltwater is sprayed into the air as particles. When those salt and water particles settle on metal surfaces, they can cause corrosion, which is why it’s common to see heavily corroded structures near the ocean.\n\nAt nuclear waste storage locations near the ocean, that salt spray can settle on the steel canisters. Generally, stainless steel is resistant to corrosion, which you can see in the shiny pots and pans in many Americans’ kitchens. But in certain circumstances, localized pits and cracks can form on stainless steel surfaces.\n\nIn recent years, the U.S. Department of Energy has funded research, including my own, into the potential dangers of this type of corrosion. The general findings are that stainless steel canisters could pit or crack when stored near a seashore. But a radioactive leak would require not only corrosion of the container but also of the zirconium rods and of the fuel inside them. So it is unlikely that this type of corrosion would result in the release of radioactivity.\n\nA long way off\n\nA more permanent solution is likely years, or decades, away.\n\nNot only must a long-term site be geologically suitable to store nuclear waste for thousands of years, but it must also be politically palatable to the American people. In addition, there will be many challenges associated with transporting the waste, in its containers, by road or rail, from reactors across the country to wherever that permanent site ultimately is.\n\nPerhaps there will be a temporary site whose location passes muster with the Supreme Court. But in the meantime, the waste will stay where it is.\n\nThis article was originally published on The Conversation. Read the original article.", "image": "https://static.scientificamerican.com/dam/m/4d265fb229a202fa/original/Storage-site-for-high-level-radioactive-waste-at-the-Hanford-Reservation-The-site-once-produced-plutonium-for-nuclear-weapons.jpg?m=1744665155.998&w=1200", "images": ["https://static.scientificamerican.com/dam/m/7b7348cccdc6e39e/original/Salt-spray-from-the-ocean-can-corrode-waste-containers-at-nearby-nuclear-waste-storage-sites-like-this-one-at-the-San-Onofre-Nuclear-Generating-Station-in-California.jpg?m=1744665350.463&w=900", "https://static.scientificamerican.com/dam/m/4d265fb229a202fa/original/Storage-site-for-high-level-radioactive-waste-at-the-Hanford-Reservation-The-site-once-produced-plutonium-for-nuclear-weapons.jpg?m=1744665155.998&w=1200", "https://static.scientificamerican.com/dam/m/4d265fb229a202fa/original/Storage-site-for-high-level-radioactive-waste-at-the-Hanford-Reservation-The-site-once-produced-plutonium-for-nuclear-weapons.jpg?m=1744665155.998&w=600", "https://counter.theconversation.com/content/252475/count.gif?distributor=republish-lightbox-advanced"], "authors": ["Gerald Frankel", "The Conversation Us"]}, {"title": "Contributors to Scientific American’s May 2025 Issue", "url": "https://www.scientificamerican.com/article/contributors-to-scientific-americans-may-2025-issue/", "source": "Scientific American", "category": "science", "published": "Tue, 15 Apr 2025 13:00:00 +0000", "summary": "<p>Writers, artists, photographers and researchers share the stories behind the stories</p>", "full_content": "", "text": "Caitlin O’Connell\n\nSecrets of the Pachyderm Boys Club\n\nCaitlin O’Connell (above) still gets emotional when she remembers her first encounter with an elephant. When a bull stepped in front of her vehicle in South Africa’s Kruger National Park, she looked up into the face of what felt like an old man. “This person has lived for so long, and what is his experience?” she thought. As a scientist studying elephant communication, she sees many parallels between these animals and humans. For example, “some young bulls will follow an older buddy and feed them” when they’re too old to eat on their own, she says. “This is part of what I want to get across: it’s so important for the young bulls to have these mentors,” she says of her article in this issue. “It makes an inordinate difference to their whole population.”\n\nO’Connell first studied plant hopper insects, which communicate through sound waves that travel through plant stems or leaves. Then, while working at a national park in Namibia during a gap year after her master’s program, she noticed elephants might be doing something similar. It took a decade to prove that elephants communicate with seismic rumbles, and now more sophisticated tools are allowing scientists to start decoding their meaning. Researchers have revealed that elephants are using something akin to vowels and even calling one another by name. “We’re really at the forefront of some breakthroughs here.”\n\nOn supporting science journalism\n\nIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\n\nMark Belan\n\nGraphic Science\n\nMark Belan wants to make science sexy. “It’s kind of tongue-in-cheek,” he says, but this goal nonetheless guides his work as a scientific illustrator. Science, he thinks, has acquired a reputation for being dense and dull, but to him it’s “the greatest story ever told.” As a graphics journalist, Belan aims to translate that wonder into eye-catching visuals that inspire people to appreciate sea slugs and ant colonies and other overlooked natural phenomena.\n\nFor this issue’s Graphic Science, written by Scientific American senior editor Clara Moskowitz, Belan charted the lifespans of some of Earth’s most incredible creatures, from fleeting worms to 15,000-year-old sea sponges. His graphic, which has a playful, toylike quality, invites readers into a 3D space alongside the data.\n\n“Looking at the diversity of lifespans across species on our planet really tickles the brain,” encouraging people to wonder how it all evolved, Belan says. This project reminded him of his master’s degree studies in geochemistry and astrobiology; he examined the biological footprints life leaves behind to potentially seek them elsewhere in the universe. “Chemistry and physics exist beyond Earth, right? Biology must, too,” he says. “So if we have this huge diversity just on Earth, I think it opens a question of what else is out there.”\n\nWillem Marx\n\nDeep-Sea Mining Begins\n\nFor London-based journalist Willem Marx, the circumstances around his feature on deep-sea mining were doubly unusual. First, “it rarely happens that the industry at the center of controversy says [to a journalist], ‘Come and have a look,’” he says. Yet that’s precisely what happened: Marx visited the MV Coco off the coast of Papua New Guinea to observe some of the first commercial deep-sea mining operations. Second, when Marx asked residents for their perspectives on the mining, it turned out they were learning about it for the first time—which made Marx’s role part of the story. This was “a bit unnerving” for a journalist accustomed to being a mere observer, he says.\n\nMarx travels often for assignments—when we spoke over the phone for this interview, he was reporting in Rome on the pope’s health. His time onboard the Coco was far from his first work trip at sea; in fact, he’d visited the very same ship while writing about the recovery mission for the Titan submersible, which imploded on its way to visit the Titanic wreckage.\n\nThis stint on the Coco came with an unusual requirement: a three-day safety course that involved plunging upside down into a pool in a mock helicopter, then breaking the helicopter window to swim out. “That’s a pretty intense requirement for a story outside of a combat zone, as far as I’m concerned.”\n\nHannah Nordhaus\n\nA New Threat to Honeybees\n\nIn 2006 worker bees in hives across the U.S. began disappearing. The causes of this devastating phenomenon, called colony collapse disorder, remain largely a mystery, says journalist Hannah Nordhaus, who covered this event in her 2011 book, The Beekeeper’s Lament (Harper Perennial). But the epidemic probably had something to do with varroa mites—tiny parasites the industry had been battling for years. As Nordhaus writes in her feature for this issue, there will soon be a new, more deadly mite in town. Tropilaelaps, or tropi, mites “add another element of precarity” to the already risky beekeeping industry on which so many crops depend, she explains. Like this story, “all my bee stories have started with people,” Nordhaus says. This article begins with Sammy Ramsey of the University of Colorado Boulder, who is sounding the alarm on tropi mites.\n\nNordhaus, who lives in Boulder, was raised in Washington, D.C., in a family involved in politics and environmentalism. Her roots, though, are farther west. Her second book, American Ghost (HarperCollins, 2015), tells the story of her great-great-grandmother, whose ghost was said to haunt a hotel in Santa Fe, N.M. As soon as Nordhaus had the opportunity, she moved out west, where her passions for history and the environment are both engaged. “In any history of the American West, there’s always an environmental strand that weaves through it.”", "image": "https://static.scientificamerican.com/dam/m/7c13ae68bd3623a9/original/sa0525Cont01a.jpg?m=1743615781.874&w=1200", "images": ["https://static.scientificamerican.com/dam/m/7c13ae68bd3623a9/original/sa0525Cont01a.jpg?m=1743615781.874&w=600", "https://static.scientificamerican.com/dam/m/57a8a02acaee5331/original/sa0525Cvr.jpg?m=1743170253.741", "https://static.scientificamerican.com/dam/m/7c13ae68bd3623a9/original/sa0525Cont01a.jpg?m=1743615781.874&w=1200"], "authors": ["Allison Parshall", "Jen Schwartz"]}, {"title": "Readers Respond to the January 2025 Issue", "url": "https://www.scientificamerican.com/article/readers-respond-to-the-january-2025-issue/", "source": "Scientific American", "category": "science", "published": "Tue, 15 Apr 2025 13:00:00 +0000", "summary": "<p>Letters to the editors for the January 2025 issue of <i>Scientific American</i></p>", "full_content": "", "text": "HIDDEN PLANET\n\nAfter I read “The Hunt for Planet Nine,” by Robin George Andrews, it occurred to me that one thing that should be discussed is the possibility of sending a probe out to this hidden planet in our solar system, should the new Vera C. Rubin Observatory confirm its existence.\n\nJAMES W. SCOTT VERNON, N.J.\n\nOn supporting science journalism\n\nIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\n\nIf new instruments and surveys provide clear evidence that Planet Nine likely exists, but then it continues to evade detection, that would increase speculation that it might be a primordial black hole. Would there be any hope of detecting such a black hole?\n\nRON PHILO KANSAS CITY, KANS.\n\nWhat are the chances that Planet Nine is a brown dwarf? That could explain its elusiveness.\n\nCAROLINE KIRSCH VIA E-MAIL\n\nANDREWS REPLIES: To answer Scott: If Planet Nine is discovered, I’m confident a probe would eventually be sent to it! But after launch it might take decades for a spacecraft to reach that destination, so you’d have to be incredibly patient.\n\nIn response to Philo: A small primordial black hole isn’t impossible, but such objects remain theoretical, and as astronomer Mike Brown noted in my article, it’s far more likely that Planet Nine is just a difficult-to-find planet. It might be one that’s so dim that it doesn’t reflect much light.\n\nRegarding Kirsch’s question: I think a brown dwarf is simply too massive to explain the gravitational perturbances detected by astronomers. It’s more likely to be a stealthy, lighter planet.\n\nPLACEBO EFFECT AND THE VAGUS NERVE\n\n“Untangling the Vagus Nerve,” by Jena Pincott, prompts a question: Does the vagus nerve itself orchestrate the placebo effect?\n\nRICHARD BUCHANAN LONDON\n\nPINCOTT REPLIES: This inquiry raises an intriguing question. There is certainly a case to be made that the vagus nerve plays a role—directly or indirectly—in the placebo response. The expectation of an effective treatment could conceivably activate vagal pathways that influence various parts of the body, including the heart and gut, which in turn communicate with the brain. Seen this way, the placebo effect is not “all in the head” but instead involves deeper physiological mechanisms than previously understood.\n\nWith respect to vagus nerve stimulation (VNS) for major depression, however, its effects on successfully treated patients appear to extend beyond placebo. Whereas the placebo responses tend to kick in quickly but are short-lived, VNS has been shown to induce gradual, cumulative improvements that persist over years of treatment. Moreover, neuroimaging studies for both VNS and transcutaneous VNS have shown changes in brain regions that didn’t occur in sham treatments. Future research should deepen our understanding of how the vagus nerve contributes to placebo effects while driving lasting physiological changes.\n\nTILING SHAPES\n\nIn “Tessellation Revelation” [December 2024], Elise Cutts discusses mathematician Gábor Domokos’s work on tiling “soft cell” shapes in two and three dimensions. Is there research into tiling in dimensions greater than three?\n\nBRUCE BAKELY SAN DIEGO, CALIF.\n\nThe image of a 3D-printed soft cell derived from a hexagonal prism in Cutts’s article bears a resemblance to the curvy lines of an ancient Egyptian artifact called the Sabu disk. Is that purely accidental?\n\nREINHOLD SCHLIEPER VIA E-MAIL\n\nCUTTS REPLIES: Bakely is not alone in pondering four-dimensional soft cells. “We are often getting this question,” Domokos says. But he says his team hasn’t set about answering it—yet. Other projects have the researchers’ attention for now.\n\nRegarding the Sabu disk: “This is stunning!” Domokos says. Because there is only a single example of the artifact, it’s hard to say for sure why it has the geometry it does. But Domokos thinks there might be a reason the disk looks like a soft cell. Let’s say you had a closed area with sixfold symmetry (like a regular hexagon) and wanted to turn its 2D curve into a 3D curve. If you tried to preserve as much of the boundary’s symmetry as possible while keeping curvature to a minimum, Domokos says, you would end up with something like the Sabu disk’s perimeter—and the boundary curve of the soft cell based on the hexagonal prism. Although it’s a mystery what motivated the creators of the Sabu disk, “I think we acted under similar constraints and got similar results,” Domokos says. “Beautiful!”\n\nHUBBLE TENSION\n\n“Cosmic Confusion,” by Marc Kamionkowski and Adam G. Riess [November 2024], explores whether a new form of dark energy can resolve the so-called Hubble tension, the disagreement among estimates of how fast the universe is expanding. Can it be ruled out that dark energy is a force field produced by another nearby universe or even another universe that encloses ours?\n\nJIM SULLIVAN VIA E-MAIL\n\nIs it possible that the universe is spinning? If so, how would it do so? And could that affect the different expansion rates that have been observed, as if we were a slice of pepperoni on a pizza observing the pizza expand around us as it was tossed into the air?\n\nCAMPBELL HODGSON VIA E-MAIL\n\nTHE AUTHORS REPLY: Sullivan’s interesting question would require more work to define and understand before it could be answered. People have indeed floated ideas about models with extra spacetime dimensions. There may be other universes that could be “near” our own in some of these extra spatial dimensions. We’re not familiar with any work to implement these ideas in a solution to the Hubble tension, though.\n\nHodgson brings up an excellent question, but we think the answer is no. In a spinning body, the speed at which something moves is proportional to its distance from the center. As physicists, we would say the universe is so big that even if it were spinning extremely slowly, there would be some distance at which things would be moving faster than the speed of light, which is not allowed. And observations so far support that the universe is uniform in all directions, which would preclude spinning.\n\nCLARIFICATION\n\n“The Astronaut Club,” by Clara Moskowitz and Zane Wolf [Graphic Science; February], noted that Oliver Daemen became the youngest person in space at age 18 in 2021. He was 18.92 years old at the time and was followed by Anastatia Mayers, who went to space at the younger age of 18.87 years in 2023.\n\nERRATUM\n\nIn “Untangling the Vagus Nerve,” by Jena Pincott, the graphic “Anatomy of the Vagus Nerve” incorrectly identified the pons of the brain stem as the medulla of the brain stem.", "image": "https://static.scientificamerican.com/dam/m/428480bb89807385/original/sa0525-Letters-IssueCover.jpg?m=1743616699.732&w=1200", "images": ["https://static.scientificamerican.com/dam/m/428480bb89807385/original/sa0525-Letters-IssueCover.jpg?m=1743616699.732&w=1200", "https://static.scientificamerican.com/dam/m/428480bb89807385/original/sa0525-Letters-IssueCover.jpg?m=1743616699.732&w=600", "https://static.scientificamerican.com/dam/m/57a8a02acaee5331/original/sa0525Cvr.jpg?m=1743170253.741"], "authors": ["Aaron Shattuck"]}, {"title": "There Is No Such Thing as a Climate Haven", "url": "https://www.scientificamerican.com/article/there-is-no-such-thing-as-a-climate-haven/", "source": "Scientific American", "category": "science", "published": "Tue, 15 Apr 2025 13:00:00 +0000", "summary": "<p>Climate change is everywhere. Moving to a new place because it seems less affected is a fool&rsquo;s errand</p>", "full_content": "", "text": "In September 2024 Hurricane Helene flooded the mountain town of Asheville, N.C., which had once been called a climate haven, a place less prone to the toll of climate change. In March 2025 fires coursed throughout the state. Fires also claimed Myrtle Beach, on the South Carolina coast. From sea to sky, the Carolinas have been grappling with disaster.\n\nAll the while, people make lists of places in the U.S. that are supposedly more resistant to climate change. They lie farther north, presumed to be better insulated from global warming, or near rivers or lakes that would ballast drought. Buffalo, N.Y., Ann Arbor, Mich., Burlington, Vt. Not to mention Asheville.\n\nBut what befell Asheville illustrates how no place in the U.S.—in the world, really—is safe from the ravages of the climate crisis. There are no climate havens. Places touted as less prone to heat, such as Asheville, are subject to floods and more intense snowfall. Those close to water face rising sea levels or floods. Population growth would strain water supplies, eventually spoiling these places as the rest of the country continues to endure more intense wildfires, more destructive hurricanes and tornadoes, prolonged droughts, and intensifying heat waves. There is nowhere to run to get away from climate change.\n\nOn supporting science journalism\n\nIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\n\nEarth’s temperature is increasing, polar ice is melting, and the northern U.S. is seeing summer heat like never before. Winter freezes are crippling the power grid in Texas and other southern regions. Migration is not a quick fix for the climate crisis, and it certainly isn’t the most equitable. We must recognize that in addition to curbing our fossil-fuel use, adequately fortifying and restructuring the spaces we already have will give us and the next generations the best possible chance of survival.\n\nHow every level of government chooses to respond to this crisis will matter.\n\nFirst and foremost, we need governance at all levels to accept not only that climate change is real but that it is something we must both adapt to and mitigate. These two ideas are not mutually exclusive—choosing adaptation, or changing our local environments to make them more resilient to climate change, doesn’t mean we no longer try to slow that change.\n\nPerhaps on top of its favorable location and weather, Asheville was considered a climate haven because its local government has accepted the reality of climate change. Before the floods came, the city had approved its Municipal Climate Action Plan, setting goals for renewable energy, more sustainable infrastructure and reduced waste production in the city. The plan states that one of its goals is an increase in renewable energy generation, including the use of solar panels to power city-owned properties and adherence to sustainable practices for new construction and retrofits. But with the loss of tree cover and the demands of a growing population making Asheville more vulnerable to landslides, the city will have to continue to adjust—as will the state, which has its own climate resiliency plan.\n\nBut will North Carolina be able to use disaster relief to push through a sustainable recovery under threat from the politicization of climate change? The state’s resiliency office is underfunded even though the new governor, Josh Stein, campaigned in part on building a state better able to withstand the effects of climate change. It’s not immediately clear how his slew of disaster-related executive orders about temporary housing and rebuilding roads and bridges will factor into adaptation efforts.\n\nWhat is clear is that the idea that people will be able to up and move to some cities or states that seem more able to withstand our climate crisis is profoundly unjust. The median home price in Washtenaw County, Michigan, where Ann Arbor is located, is about $380,000. That makes it the second-most expensive county in the state. Other Michigan counties are significantly cheaper, but few are prepared, or even preparing, for permanent population increases. Winter is getting shorter along the Great Lakes, and not only is flooding becoming more of an issue, but the weather is getting hotter. Even housing prices in Buffalo are increasing.\n\nThe bottom line is that historically mild weather, historically agreeable climates and historically responsive governments have made some places in the U.S. seemingly more resistant to the effects of climate change. But the crisis knows no boundaries—Canadian wildfires blew smoke into New York City last summer and blanketed Buffalo the year before. Even adaptation won’t completely solve the problem.\n\nIn the end, how every level of government chooses to respond to this crisis will matter. Individual cities can’t manage this problem alone, and neither can states. How will cities such as Austin, Tex., make meaningful adaptations in one of the U.S. states most susceptible to global warming if its governor and legislature largely downplay climate concerns and actively thwart efforts to reduce fossil-fuel use? Texas’s water supply is in dire straits, and far too many people there and in places such as Arizona will be left behind in this great migration north.\n\nAnd how will we fare as a nation under an administration that denies climate change is real? One that is actively rolling back environmental protections, throwing out environmental justice cases, and promoting the production of more and more fossil fuels?\n\nThe idea that any one place in any nation is more resistant or more resilient to forces that are global in nature is clever marketing and nothing else. The message might make people feel better by letting them believe they can just escape the climate crisis by moving to a different city, but this is a bill of goods. Our entire planet is in the throes of warming. Rather than trying to outrun it, we must demand leadership that will help fund our efforts to adapt, look to state and local leaders to make those adaptation plans reality, and continue to seek ways to change the very things that started this climate-haven conversation in the first place—burning fossil fuels and abusing our forests, farmlands and good fortune.", "image": "https://static.scientificamerican.com/dam/m/938af0b533feed9/original/sa0525Agnd01.jpg?m=1743617306.943&w=1200", "images": ["https://static.scientificamerican.com/dam/m/57a8a02acaee5331/original/sa0525Cvr.jpg?m=1743170253.741", "https://static.scientificamerican.com/dam/m/938af0b533feed9/original/sa0525Agnd01.jpg?m=1743617306.943&w=600", "https://static.scientificamerican.com/dam/m/938af0b533feed9/original/sa0525Agnd01.jpg?m=1743617306.943&w=1200"], "authors": ["The Editors"]}, {"title": "Why Some Animals Live for Only Days and Others Live for Thousands of Years", "url": "https://www.scientificamerican.com/article/why-some-animals-live-for-only-days-and-others-live-for-thousands-of-years/", "source": "Scientific American", "category": "science", "published": "Tue, 15 Apr 2025 13:00:00 +0000", "summary": "<p>Scientists are studying why some species live so much longer than others</p>", "full_content": "", "text": "Scientists are studying why some species live so much longer than others\n\nWhy Some Animals Live for Only Days and Others Live for Thousands of Years\n\nI agree my information will be processed in accordance with the Scientific American and Springer Nature Limited Privacy Policy\n\nSome species seem to live fast and die young. Others, though, “appear not to age,” says João Pedro de Magalhães, a molecular biologist at the University of Birmingham in England. He is project leader of the Human Ageing Genomic Resources program, which keeps the AnAge database of maximum animal lifespans. Some species of turtles, fishes and salamanders, for instance, don’t show any signs of degeneration or senescence as they grow older. If they didn’t die of predation, accidents or infectious disease, they could live extremely long lives, Magalhães says.\n\n“It’s a biological mystery why some species age faster than others,” Magalhães says. “We still don’t understand well the mechanisms behind aging.” Species that face high predation usually evolve to grow quickly and reach sexual maturity rapidly. Other creatures that don’t face pressure to reproduce early can age slowly: Greenland sharks, for instance (the top of their food chain), may take 150 years to reach sexual maturity.\n\nDNA mutations are thought to play a role in determining lifespans, with longer-lived species tending to evolve better DNA-repair systems to help ward off cancer. Short-lived creatures, such as mice, don’t have these abilities, because in the wild they often die of predation before cancer becomes an issue. Laboratory-raised mice, however, have very high rates of cancer.\n\nOn supporting science journalism\n\nIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.", "image": "https://static.scientificamerican.com/dam/m/7b6ca094e42e420a/original/saw0525Gsci_lead.jpg?m=1744037610.786&w=1200", "images": ["https://static.scientificamerican.com/dam/m/7b6ca094e42e420a/original/saw0525Gsci_lead.jpg?m=1744037610.786&w=600", "https://static.scientificamerican.com/dam/m/57a8a02acaee5331/original/sa0525Cvr.jpg?m=1743170253.741", "https://static.scientificamerican.com/dam/m/7b6ca094e42e420a/original/saw0525Gsci_lead.jpg?m=1744037610.786&w=1200", "https://static.scientificamerican.com/dam/m/29e79de0f229a976/original/saw0525Gsci31_d_TEXT.png?m=1744403714.268&w=900"], "authors": ["Clara Moskowitz", "Mark Belan", "Jen Christiansen"]}, {"title": "Math Puzzle: Construct the Dice", "url": "https://www.scientificamerican.com/article/math-puzzle-construct-the-dice/", "source": "Scientific American", "category": "science", "published": "Tue, 15 Apr 2025 13:00:00 +0000", "summary": "<p>Build a special set of dice in this math puzzle</p>", "full_content": "", "text": "The sides of the die must be labeled 0, 0, 0, 6, 6 and 6.\n\nThere are 36 possible totals when rolling two dice. If the 12 sum values are all to have the same probability, then each value must occur exactly three times.\n\nAmanda Montañez\n\nThe total value of 12 can be achieved with two dice only if both dice show a 6. Because the value 12 must appear three times in the table, the cube Marie labels must have three sides with a 6. The rest of the needed results are possible only if the other three sides are labeled with a 0.\n\nFor each sum value from 1 to 12, the probability p is\n\np = 3 / 36 = 1 / 12 ≈ 8.3%", "image": "https://static.scientificamerican.com/dam/m/3da926a3ccf413bb/original/mathPuzzles-opener.jpg?m=1723038172.878", "images": ["https://static.scientificamerican.com/dam/m/26d31551d5b41c11/original/saw0525Adva33_d2_TEXT.png?m=1744386273.967&w=900", "https://static.scientificamerican.com/dam/m/3da926a3ccf413bb/original/mathPuzzles-opener.jpg?m=1723038172.878", "https://static.scientificamerican.com/dam/m/6c205fbb1db85e87/original/saw0525Adva33_d1_TEXT.png?m=1744386381.492&w=900"], "authors": ["Hans-Karl Eder"]}, {"title": "FCC Chairman Tells Europe To Choose Between US or Chinese Communications Tech", "url": "https://tech.slashdot.org/story/25/04/15/1514205/fcc-chairman-tells-europe-to-choose-between-us-or-chinese-communications-tech?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "Slashdot", "category": "technology", "published": "2025-04-15 14:10:49", "summary": "FCC Chairman Brendan Carr has issued a stark ultimatum to European allies, telling them to choose between US and Chinese communications technology. In an interview with Financial Times, Carr urged \"allied western democracies\" to \"focus on the real long-term bogey: the rise of the Chinese Communist party.\" The warning comes as European governments question Starlink's reliability after Washington threatened to switch off its services in Ukraine. \n\nUK telecoms BT and Virgin Media O2 are currently trialing Starlink's satellite internet technology but haven't signed full agreements. \"If you're concerned about Starlink, just wait for the CCP's version, then you'll be really worried,\" said Carr. Carr claimed Europe is \"caught\" between Washington and Beijing, with a \"great divide\" emerging between \"CCP-aligned countries and others\" in AI and satellite technology. He also accused the European Commission of \"protectionism\" and an \"anti-American\" attitude while suggesting Nokia and Ericsson should relocate manufacturing to the US to avoid Trump's import tariffs.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=FCC+Chairman+Tells+Europe+To+Choose+Between+US+or+Chinese+Communications+Tech%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F15%2F1514205%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F15%2F1514205%2Ffcc-chairman-tells-europe-to-choose-between-us-or-chinese-communications-tech%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/25/04/15/1514205/fcc-chairman-tells-europe-to-choose-between-us-or-chinese-communications-tech?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>", "full_content": "", "text": "FCC Chairman Brendan Carr has issued a stark ultimatum to European allies, telling them to choose between US and Chinese communications technology . In an interview with Financial Times, Carr urged \"allied western democracies\" to \"focus on the real long-term bogey: the rise of the Chinese Communist party.\" The warning comes as European governments question Starlink's reliability after Washington threatened to switch off its services in Ukraine.UK telecoms BT and Virgin Media O2 are currently trialing Starlink's satellite internet technology but haven't signed full agreements. \"If you're concerned about Starlink, just wait for the CCP's version, then you'll be really worried,\" said Carr. Carr claimed Europe is \"caught\" between Washington and Beijing, with a \"great divide\" emerging between \"CCP-aligned countries and others\" in AI and satellite technology. He also accused the European Commission of \"protectionism\" and an \"anti-American\" attitude while suggesting Nokia and Ericsson should relocate manufacturing to the US to avoid Trump's import tariffs.", "image": "https://a.fsdn.com/sd/topics/communications_64.png", "images": ["https://a.fsdn.com/sd/ccpa-optout.png", "https://a.fsdn.com/sd/topics/communications_64.png", "https://a.fsdn.com/sd/topics/facebook_64.png", "https://slashdot.org/images/njs.gif?248", "https://a.fsdn.com/sd/topics/ai_64.png"], "authors": ["Posted"]}, {"title": "Indian IT Faces Its Kodak Moment", "url": "https://it.slashdot.org/story/25/04/15/0259250/indian-it-faces-its-kodak-moment?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "Slashdot", "category": "technology", "published": "2025-04-15 14:10:49", "summary": "An anonymous reader shares a report: Generative AI offers remarkable efficiency gains while presenting a profound challenge for the global IT services industry -- a sector concentrated in India and central to its export economy. \n\nFor decades, Indian technology firms thrived by deploying their engineering talent to serve primarily Western clients. Now they face a critical question. Will AI's productivity dividend translate into revenue growth? Or will fierce competition see these gains competed away through price reductions? \n\nIndustry soundings suggest the deflationary dynamic may already be taking hold. JPMorgan's conversations with executives, deal advisors and consultants across India's technology hubs reveal growing concern -- AI-driven efficiencies are fuelling pricing pressures. This threatens to constrain medium-term industry growth to a modest 4-5%, with little prospect of acceleration into fiscal year 2026. This emerging reality challenges the earlier narrative that AI would primarily unlock new revenue streams.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Indian+IT+Faces+Its+Kodak+Moment%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F04%2F15%2F0259250%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F04%2F15%2F0259250%2Findian-it-faces-its-kodak-moment%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://it.slashdot.org/story/25/04/15/0259250/indian-it-faces-its-kodak-moment?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>", "full_content": "", "text": "One has to look out for engineers -- they begin with sewing machines and end up with the atomic bomb. -- Marcel Pagnol", "image": "https://a.fsdn.com/sd/topics/ai_64.png", "images": ["https://a.fsdn.com/sd/topics/business_64.png", "https://a.fsdn.com/sd/ccpa-optout.png", "https://a.fsdn.com/sd/topics/medicine_64.png?refresh=now", "https://slashdot.org/images/njs.gif?974", "https://a.fsdn.com/sd/topics/china_64.png", "https://a.fsdn.com/sd/topics/it_64.png", "https://a.fsdn.com/sd/topics/technology_64.png", "https://a.fsdn.com/sd/topics/ai_64.png"], "authors": ["Posted"]}, {"title": "OpenAI is Building a Social Network", "url": "https://tech.slashdot.org/story/25/04/15/1648226/openai-is-building-a-social-network?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "Slashdot", "category": "technology", "published": "2025-04-15 14:10:48", "summary": "An anonymous reader shares a report: OpenAI is working on its own X-like social network, according to multiple sources familiar with the matter. While the project is still in early stages, we're told there's an internal prototype focused on ChatGPT's image generation that has a social feed. CEO Sam Altman has been privately asking outsiders for feedback about the project, our sources say. It's unclear if OpenAI's plan is to release the social network as a separate app or integrate it into ChatGPT, which became the most downloaded app globally last month. \n\nLaunching a social network in or around ChatGPT would likely increase Altman's already-bitter rivalry with Elon Musk. In February, after Musk made an unsolicited offer to purchase OpenAI for $97.4 billion, Altman responded: \"no thank you but we will buy twitter for $9.74 billion if you want.\" Entering the social media market also puts OpenAI on more of a collision course with Meta, which we're told is planning to add a social feed to its coming standalone app for its AI assistant. When reports of Meta building a rival to the ChatGPT app first surfaced a couple of months ago, Altman shot back on X again by saying, \"ok fine maybe we'll do a social app.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+is+Building+a+Social+Network%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F15%2F1648226%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F15%2F1648226%2Fopenai-is-building-a-social-network%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/25/04/15/1648226/openai-is-building-a-social-network?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>", "full_content": "", "text": "One has to look out for engineers -- they begin with sewing machines and end up with the atomic bomb. -- Marcel Pagnol", "image": "https://a.fsdn.com/sd/topics/social_64.png", "images": ["https://a.fsdn.com/sd/ccpa-optout.png", "https://a.fsdn.com/sd/topics/android_64.png", "https://a.fsdn.com/sd/topics/social_64.png", "https://slashdot.org/images/njs.gif?94", "https://a.fsdn.com/sd/topics/ai_64.png"], "authors": ["Posted"]}, {"title": "Zuckerberg Had a 'Crazy Idea' in 2022 For Facebook - Purge All Users' Friends", "url": "https://tech.slashdot.org/story/25/04/15/1536244/zuckerberg-had-a-crazy-idea-in-2022-for-facebook---purge-all-users-friends?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "Slashdot", "category": "technology", "published": "2025-04-15 14:10:48", "summary": "Meta CEO Mark Zuckerberg considered resetting all Facebook users' friend connections to boost the platform's declining relevance, according to internal emails revealed Monday in a landmark FTC antitrust trial. In a 2022 message to executives, Zuckerberg proposed \"wiping everyone's graphs and having them start again,\" referring to users' friend networks. Facebook head Tom Alison questioned the idea's viability, citing Instagram's reliance on friend connections. Zuckerberg later testified that the plan was never implemented and that Facebook has \"evolved\" from its original purpose. \n\nThe FTC argues Meta violated competition laws by acquiring Instagram ($1B) and WhatsApp ($19B) as part of a \"buy or bury\" strategy outlined in Zuckerberg's 2008 email stating, \"It is better to buy than compete.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Zuckerberg+Had+a+'Crazy+Idea'+in+2022+For+Facebook+-+Purge+All+Users'+Friends%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F15%2F1536244%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F15%2F1536244%2Fzuckerberg-had-a-crazy-idea-in-2022-for-facebook---purge-all-users-friends%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/25/04/15/1536244/zuckerberg-had-a-crazy-idea-in-2022-for-facebook---purge-all-users-friends?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>", "full_content": "", "text": "Meta CEO Mark Zuckerberg considered resetting all Facebook users' friend connections to boost the platform's declining relevance, according to internal emails revealed Monday in a landmark FTC antitrust trial. In a 2022 message to executives, Zuckerberg proposed \"wiping everyone's graphs and having them start again,\" referring to users' friend networks. Facebook head Tom Alison questioned the idea's viability, citing Instagram's reliance on friend connections. Zuckerberg later testified that the plan was never implemented and that Facebook has \"evolved\" from its original purpose.The FTC argues Meta violated competition laws by acquiring Instagram ($1B) and WhatsApp ($19B) as part of a \"buy or bury\" strategy outlined in Zuckerberg's 2008 email stating, \"It is better to buy than compete.\"", "image": "https://a.fsdn.com/sd/topics/facebook_64.png", "images": ["https://a.fsdn.com/sd/ccpa-optout.png", "https://slashdot.org/images/njs.gif?123", "https://a.fsdn.com/sd/topics/android_64.png", "https://a.fsdn.com/sd/topics/social_64.png", "https://a.fsdn.com/sd/topics/communications_64.png", "https://a.fsdn.com/sd/topics/facebook_64.png"], "authors": ["Posted"]}, {"title": "Uber Cofounder Kalanick Says AI Means Some Consultants Are in 'Big Trouble'", "url": "https://slashdot.org/story/25/04/15/1918257/uber-cofounder-kalanick-says-ai-means-some-consultants-are-in-big-trouble?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "Slashdot", "category": "technology", "published": "2025-04-15 14:10:47", "summary": "Uber cofounder Travis Kalanick thinks AI is about to shake up consulting -- and for \"traditional\" professionals, not in a good way. From a report: The former Uber CEO said consultants who mostly follow instructions or do repetitive tasks are at risk of being replaced by AI. \"If you're a traditional consultant and you're just doing the thing, you're executing the thing, you're probably in some big trouble,\" he said. He joked about what that future of consultancy might look like: \"Push a button. Get a consultant.\" \n\nHowever, Kalanick said the professionals who would come out ahead would be the ones who build tools rather than just use them. \"If you are the consultant that puts the things together that replaces the consultant, maybe you got some stuff,\" he said. \"You're going to profitable companies with competitive moats, making that moat bigger,\" he explained. \"Making their profit bigger is probably pretty interesting from a financial point of view.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Uber+Cofounder+Kalanick+Says+AI+Means+Some+Consultants+Are+in+'Big+Trouble'%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F04%2F15%2F1918257%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F04%2F15%2F1918257%2Fuber-cofounder-kalanick-says-ai-means-some-consultants-are-in-big-trouble%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://slashdot.org/story/25/04/15/1918257/uber-cofounder-kalanick-says-ai-means-some-consultants-are-in-big-trouble?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>", "full_content": "", "text": "One has to look out for engineers -- they begin with sewing machines and end up with the atomic bomb. -- Marcel Pagnol", "image": "https://a.fsdn.com/sd/topics/ai_64.png", "images": ["https://a.fsdn.com/sd/topics/programming_64.png", "https://a.fsdn.com/sd/ccpa-optout.png", "https://a.fsdn.com/sd/topics/ai_64.png", "https://slashdot.org/images/njs.gif?757"], "authors": ["Posted"]}, {"title": "You Should Still Learn To Code, Says GitHub CEO", "url": "https://developers.slashdot.org/story/25/04/15/1853254/you-should-still-learn-to-code-says-github-ceo?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "Slashdot", "category": "technology", "published": "2025-04-15 14:10:47", "summary": "You should still learn to code, says GitHub's CEO. And you should start as soon as possible. From a report: \"I strongly believe that every kid, every child, should learn coding,\" Thomas Dohmke said in a recent podcast interview with EO. \"We should actually teach them coding in school, in the same way that we teach them physics and geography and literacy and math and what-not.\" Coding, he added, is one such fundamental skill -- and the only reason it's not part of the curriculum is because it took \"us too long to actually realize that.\" \n\nDohmke, who's been a programmer since the 90s, said he's never seen \"anything more exciting\" than the current moment in engineering -- the advent of AI, he believes, has made the field that much easier to break into, and is poised to make software more ubiquitous than ever. \"It's so much easier to get into software development. You can just write a prompt into Copilot or ChatGPT or similar tools, and it will likely write you a basic webpage, or a small application, a game in Python,\" Dohmke said. \"And so, AI makes software development so much more accessible for anyone who wants to learn coding.\" \n\nAI, Dohmke said, helps to \"realize the dream\" of bringing an idea to life, meaning that fewer projects will end up dead in the water, and smaller teams of developers will be enabled to tackle larger-scale projects. Dohmke said he believes it makes the overall process of creation more efficient. \"You see some of the early signs of that, where very small startups -- sometimes five developers and some of them actually only one developer -- believe they can become million, if not billion dollar businesses by leveraging all the AI agents that are available to them,\" he added.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=You+Should+Still+Learn+To+Code%2C+Says+GitHub+CEO%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F25%2F04%2F15%2F1853254%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F25%2F04%2F15%2F1853254%2Fyou-should-still-learn-to-code-says-github-ceo%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/25/04/15/1853254/you-should-still-learn-to-code-says-github-ceo?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>", "full_content": "", "text": "You should still learn to code, says GitHub's CEO. And you should start as soon as possible . From a report:", "image": "https://a.fsdn.com/sd/topics/programming_64.png", "images": ["https://slashdot.org/images/njs.gif?453", "https://a.fsdn.com/sd/topics/programming_64.png", "https://a.fsdn.com/sd/ccpa-optout.png", "https://a.fsdn.com/sd/topics/ai_64.png"], "authors": ["Posted"]}, {"title": "Google DeepMind Is Hiring a 'Post-AGI' Research Scientist", "url": "https://slashdot.org/story/25/04/15/182244/google-deepmind-is-hiring-a-post-agi-research-scientist?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "Slashdot", "category": "technology", "published": "2025-04-15 14:10:47", "summary": "An anonymous reader shares a report: None of the frontier AI research labs have presented any evidence that they are on the brink of achieving artificial general intelligence, no matter how they define that goal, but Google is already planning for a \"Post-AGI\" world by hiring a scientist for its DeepMind AI lab to research the \"profound impact\" that technology will have on society. \n\n\"Spearhead research projects exploring the influence of AGI on domains such as economics, law, health/wellbeing, AGI to ASI [artificial superintelligence], machine consciousness, and education,\" Google says in the first item on a list of key responsibilities for the job. Artificial superintelligence refers to a hypothetical form of AI that is smarter than the smartest human in all domains. This is self explanatory, but just to be clear, when Google refers to \"machine consciousness\" it's referring to the science fiction idea of a sentient machine. \n\nOpenAI CEO Sam Altman, DeepMind CEO Demis Hassabis, Elon Musk, and other major and minor players in the AI industry are all working on AGI and have previously talked about the likelihood of humanity achieving AGI, when that might happen, and what the consequences might be, but the Google job listing shows that companies are now taking concrete steps for what comes after, or are at least are continuing to signal that they believe it can be achieved.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+DeepMind+Is+Hiring+a+'Post-AGI'+Research+Scientist%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F04%2F15%2F182244%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F04%2F15%2F182244%2Fgoogle-deepmind-is-hiring-a-post-agi-research-scientist%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://slashdot.org/story/25/04/15/182244/google-deepmind-is-hiring-a-post-agi-research-scientist?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>", "full_content": "", "text": "One has to look out for engineers -- they begin with sewing machines and end up with the atomic bomb. -- Marcel Pagnol", "image": "https://a.fsdn.com/sd/topics/ai_64.png", "images": ["https://a.fsdn.com/sd/ccpa-optout.png", "https://slashdot.org/images/njs.gif?636", "https://a.fsdn.com/sd/topics/social_64.png", "https://a.fsdn.com/sd/topics/programming_64.png", "https://a.fsdn.com/sd/topics/ai_64.png"], "authors": ["Posted"]}, {"title": "Apple Says All Mac Minis With Intel Are Now Vintage", "url": "https://apple.slashdot.org/story/25/04/15/2010214/apple-says-all-mac-minis-with-intel-are-now-vintage?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "Slashdot", "category": "technology", "published": "2025-04-15 14:10:46", "summary": "Apple has officially designated all Intel-based Mac minis as \"vintage\" or \"obsolete,\" marking the end of an era. This means Apple no longer guarantees parts or service for these devices, as they've surpassed the 5- to 7-year support window. 9to5Mac reports: Apple periodically adds devices to its ever-growing list of vintage and obsolete products. That happened today, as spotted by MacRumors, with two noteworthy \"vintage\" additions: iPhone 6s and Mac mini (2018). The latter product is especially significant, because the 2018 Mac mini was the last remaining Intel model that was not yet labeled either vintage or obsolete.\n \nSo what are those timelines exactly? Per Apple's definitions:\nVintage: \"Apple stopped distributing them for sale more than 5 and less than 7 years ago.\" Obsolete: \"Apple stopped distributing them for sale more than 7 years ago.\" [...] Since these products are now considered vintage, Apple no longer guarantees that parts for repairs will be readily available.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Says+All+Mac+Minis+With+Intel+Are+Now+Vintage%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F04%2F15%2F2010214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F04%2F15%2F2010214%2Fapple-says-all-mac-minis-with-intel-are-now-vintage%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://apple.slashdot.org/story/25/04/15/2010214/apple-says-all-mac-minis-with-intel-are-now-vintage?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>", "full_content": "", "text": "Apple has officially designated all Intel-based Mac minis as \"vintage\" or \"obsolete ,\" marking the end of an era. This means Apple no longer guarantees parts or service for these devices, as they've surpassed the 5- to 7-year support window. 9to5Mac reports:", "image": "https://a.fsdn.com/sd/topics/mac_64.png", "images": ["https://a.fsdn.com/sd/topics/iphone_64.png", "https://a.fsdn.com/sd/topics/mac_64.png", "https://a.fsdn.com/sd/ccpa-optout.png", "https://a.fsdn.com/sd/topics/apple_64.png", "https://a.fsdn.com/sd/topics/intel_64.png", "https://a.fsdn.com/sd/topics/programming_64.png", "https://slashdot.org/images/njs.gif?456"], "authors": []}, {"title": "Figma Sent a Cease-and-Desist Letter To Lovable Over the Term 'Dev Mode'", "url": "https://yro.slashdot.org/story/25/04/15/203233/figma-sent-a-cease-and-desist-letter-to-lovable-over-the-term-dev-mode?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "Slashdot", "category": "technology", "published": "2025-04-15 14:10:46", "summary": "An anonymous reader quotes a report from TechCrunch: Figma has sent a cease-and-desist letter to popular no-code AI startup Lovable, Figma confirmed to TechCrunch. The letter tells Lovable to stop using the term \"Dev Mode\" for a new product feature. Figma, which also has a feature called Dev Mode, successfully trademarked that term last year, according to the U.S. Patent and Trademark office. What's wild is that \"dev mode\" is a common term used in many products that cater to software programmers. It's like an edit mode. Software products from giant companies like Apple's iOS, Google's Chrome, Microsoft's Xbox have features formally called \"developer mode\" that then get nicknamed \"dev mode\" in reference materials.\n \nEven \"dev mode\" itself is commonly used. For instance Atlassian used it in products that pre-date Figma's copyright by years. And it's a common feature name in countless open source software projects. Figma tells TechCrunch that its trademark refers only to the shortcut \"Dev Mode\" -- not the full term \"developer mode.\" Still, it's a bit like trademarking the term \"bug\" to refer to \"debugging.\" Since Figma wants to own the term, it has little choice but send cease-and-desist letters. (The letter, as many on X pointed out, was very polite, too.) If Figma doesn't defend the term, it could be absorbed as a generic term and the trademarked becomes unenforceable.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Figma+Sent+a+Cease-and-Desist+Letter+To+Lovable+Over+the+Term+'Dev+Mode'%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F04%2F15%2F203233%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F04%2F15%2F203233%2Ffigma-sent-a-cease-and-desist-letter-to-lovable-over-the-term-dev-mode%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://yro.slashdot.org/story/25/04/15/203233/figma-sent-a-cease-and-desist-letter-to-lovable-over-the-term-dev-mode?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>", "full_content": "", "text": "One has to look out for engineers -- they begin with sewing machines and end up with the atomic bomb. -- Marcel Pagnol", "image": "https://a.fsdn.com/sd/topics/programming_64.png", "images": ["https://a.fsdn.com/sd/topics/mac_64.png", "https://a.fsdn.com/sd/ccpa-optout.png", "https://slashdot.org/images/njs.gif?251", "https://a.fsdn.com/sd/topics/programming_64.png", "https://a.fsdn.com/sd/topics/court_64.png", "https://a.fsdn.com/sd/topics/ai_64.png"], "authors": []}]}