{"timestamp": 1744749979.166284, "articles": [{"title": "What to know about the Trump indictment on the eve of his court appearance", "url": "https://www.cnn.com/collections/intl-trump-040223/", "source": "CNN", "published": "Wed, 05 Apr 2023 22:50:06 GMT", "summary": "", "text": "", "image": ""}, {"title": "Haberman reveals why Trump attacked judge and his family in speech", "url": "https://www.cnn.com/videos/politics/2023/04/05/maggie-haberman-donald-trump-speech-indictment-reaction-sot-cnntm-vpx.cnn", "source": "CNN", "published": "Wed, 05 Apr 2023 13:30:09 GMT", "summary": "CNN political contributor Maggie Haberman explains the reasoning behind Donald Trump's attacks on the judge and his family during a speech at his Mar-a-Lago resort after he was arraigned on felony charges.", "text": "1. How relevant is this ad to you?\n\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues", "image": "https://media.cnn.com/api/v1/images/stellar/prod/230405085526-maggie-haberman.jpg?c=16x9&q=w_800,c_fill"}, {"title": "Beijing promised to 'fight back' over Taiwan leader's US visit. But this time it has more to lose", "url": "https://www.cnn.com/2023/04/04/asia/tsai-ing-wen-taiwan-mccarthy-meeting-analysis-intl-hnk/index.html", "source": "CNN", "published": "Tue, 04 Apr 2023 07:49:53 GMT", "summary": "An anticipated meeting between Taiwan's President Tsai Ing-wen and US House Speaker Kevin McCarthy in California this week has sparked concerns of a repeat of the pressure campaign China launched last year when then-Speaker Nancy Pelosi visited Taipei.", "text": "Hong Kong CNN —\n\nAn anticipated meeting between Taiwan’s President Tsai Ing-wen and US House Speaker Kevin McCarthy in California this week has sparked concerns of a repeat of the pressure campaign China launched last year when then-Speaker Nancy Pelosi visited Taipei.\n\nAt that time, Beijing encircled the island democracy with unprecedented military drills – firing multiple missiles into its surrounding waters and sending dozens of warplanes speeding across a sensitive median line dividing the Taiwan Strait.\n\nIt also cut off contact with the United States over a number of issues from military matters to combating climate change, in retaliation for what it viewed as a violation of its sovereignty.\n\nThis time, Beijing has already threatened to “resolutely fight back” if a Tsai-McCarthy meeting goes ahead.\n\nVideo Ad Feedback See why tensions are rising between US and China over Taiwan 02:32 - Source: CNN See why tensions are rising between US and China over Taiwan 02:32\n\nIt also slammed Washington for allowing Tsai to stopover in the US while en route to and from official visits in Central America, warning it could lead to “serious” confrontation between the two powers.\n\nA defiant Tsai staked out her own ground, pledging as she took off on her 10-day trip not to let “external pressure” stop Taiwan from connecting with the world and like-minded democracies.\n\nBut the optics of the meeting, taking place in California and not Taiwan, and its timing – at a particularly thorny moment in China’s foreign relations and ahead of a presidential election in Taiwan that could reset the tone of its relationship with Beijing – may see Beijing tread more carefully this time, or at least not escalate further, analysts say.\n\n“This puts the burden on China not to overreact, because any overreaction is only going to push China further away from the world,” said Yun Sun, director of the China Program at the Stimson Center think tank in Washington.\n\nThat doesn’t mean, however, that Beijing won’t be closely watching Tsai’s movements as it calibrates its response – and decides how much military might to flex over her meeting with an American lawmaker on American soil.\n\nThe opacity of China’s system – and the potential for competing interests within its vast bureaucracy – also make it difficult to accurately predict its response.\n\n“Every time Taiwan does anything that China doesn’t like, the Chinese react with their own military coercion,” Sun said. But in the current situation, “they have to consider the consequences of overreaction,” she added.\n\nHouse Speaker Kevin McCarthy talks to reporters at the Capitol in Washington on March 24, 2023. J. Scott Applewhite/AP\n\nRising pressure\n\nThe expected meeting, which McCarthy’s office announced earlier this week would take place on Wednesday, also comes at a precarious moment in US-China relations.\n\nWashington and Beijing are struggling to stabilize their communication amid flaring tensions over issues from a downed suspected Chinese surveillance balloon to semiconductor supply chains – raising the stakes of potential damage to that relationship if Beijing lashes out as it did when Tsai met Pelosi.\n\nTaiwan is still feeling the fallout of that response last August, with Chinese military forces now regularly making incursions over what had previously been an informal but largely respected border of control between Beijing and Taipei in the Taiwan Strait. Taiwan’s official Central News Agency also reported Monday that Tsai would meet with McCarthy, citing Tsai’s presidential office.\n\nVideo Ad Feedback See image of a Chinese balloon hovering over Taiwan 03:05 - Source: CNN See image of a Chinese balloon hovering over Taiwan 03:05\n\nBut a meeting between Tsai and the leader of the Republican majority in the US House of Representatives, who ranks second in line to the Presidency, would mark another symbolic moment for Taiwan and the US, which only maintain unofficial ties.\n\nFor Tsai, who is entering the final year of her two-term presidency, “it’s clearly a capstone event,” according to Wen-Ti Sung, a political scientist at the Australian National University’s Taiwan Studies Program. “She has this image as the Taiwanese president who has taken US-Taiwan relations to new heights, and who … has been able to give Taiwan almost unprecedented international visibility,” he said.\n\nThat increased visibility – and enhanced cooperation with the US – has followed China’s mounting pressure on the island, which sits fewer than 110 miles (177 kilometers) from the mainland coast.\n\nChina’s Communist Party claims the self-governing island democracy as its own despite never having controlled it, and has vowed to take the island, by force if necessary.\n\nThe party has undertaken a sweeping expansion of its military capabilities over the past decade under leader Xi Jinping – and ramped up its pervasive economic, diplomatic and military pressure on Taiwan.\n\nThat’s driven concerns, among some in Washington, that Beijing is preparing for an invasion, though China’s official language still suggests that scenario is not its preferred option for achieving the claimed goal of “reunification.”\n\nIt is those pressures – and how to support Taiwan against unilateral actions by Beijing – that are likely to be on the table when Tsai, McCarthy and a bipartisan group of US lawmakers sit down on Wednesday.\n\nCongress has been a pillar of increasing American support for Taiwan in recent years. Lawmakers regularly visit the island and drive bipartisan legislation enhancing support and cooperation.\n\nWhile the US switched its diplomatic relations to Beijing decades ago, it maintains unofficial ties with Taiwan and is bound by law to provide the democratic island with the means to defend itself.\n\nUnder Washington’s longstanding “One China” policy, the US acknowledges China’s position that Taiwan is part of China, but has never officially recognized Beijing’s claim to the island of 23 million.\n\nThough McCarthy does not have Pelosi’s decades-long record of advocacy regarding China, the California Republican is now a leading voice pushing for closer scrutiny of Beijing, and meeting Tsai could help him to burnish that image.\n\nLast month, McCarthy told reporters that meeting Tsai in the US would not impact whether he travels to Taiwan in the future – something he had earlier said he wanted to do.\n\nFighter jets of the Chinese People's Liberation Army Eastern Theater Command conduct joint combat training exercises around Taiwan on August 7, 2022 in this photo released by Xinhua News Agency. Gong Yulong/Xinhua/AP\n\nBeijing watching\n\nA meeting in California, on US soil, is widely seen as less likely to provoke Beijing than a McCarthy visit to Taiwan.\n\nPelosi’s trip – the first from a lawmaker of that rank to the island in 25 years – generated a fever pitch of nationalist and anti-US rhetoric in mainland China.\n\nThis time, so far, domestic conversation in China’s heavily controlled media sphere has been significantly muted.\n\nBut the stakes remain high – including for Beijing itself – over how it responds, analysts say.\n\nAs Taiwan prepares for a presidential election in January, a fierce response could push voters away from Taiwan’s main opposition party Kuomintang (KMT), widely seen as more friendly toward Beijing.\n\nIt could also jar with another high profile trip happening now: a tour of mainland China from former Taiwan president and senior KMT member Ma Ying-jeou, the first visit from a current or former Taiwan leader since the end of the Chinese Civil War in 1949.\n\nMa’s tour is a “once in a half a century opportunity to send a conciliatory message between the two sides, Beijing shouldn’t want to tank that,” said Sung, the political scientist.\n\nChina is also acutely aware that its actions toward Taiwan are under a significantly brighter global spotlight following the invasion of Ukraine by Russian President Vladimir Putin, a close diplomatic partner of Xi. Putin’s rhetoric over Ukraine has echoes of how Xi speaks of Taiwan.\n\nBeijing has recently sought to position itself as an agent of peace in that conflict – especially as it aims to repair frayed ties with Europe.\n\nThis week, as Tsai is expected to meet with McCarthy, French President Emmanuel Macron and European Commission President Ursula von der Leyen will head to China – an important opportunity that Xi may not want to overshadow with military posturing.\n\nAn aggressive response also risks stoking confrontation with the US, not yet six months after Xi and US President Joe Biden called to enhance communication during a face-to-face meeting in Bali.\n\n“(A less overtly aggressive response) would imply that Beijing does not wish to escalate tension with the US to a level that can risk getting out of hand,” said Steve Tsang, director of the SOAS China Institute in London.\n\n“A reset in US-China ties is not on the agenda, but an easing of tension is not beyond the realm of possibility.”", "image": "https://media.cnn.com/api/v1/images/stellar/prod/230403194210-01-us-china-taiwan-tension.jpg?c=16x9&q=w_800,c_fill"}, {"title": "Video shows moment of deadly explosion at cafe in Russia", "url": "https://www.cnn.com/videos/world/2023/04/02/russian-military-blogger-vladlen-tatarsky-killed-cafe-explosion-chance-vpx.cnn", "source": "CNN", "published": "Tue, 04 Apr 2023 01:08:44 GMT", "summary": "A well-known Russian military blogger, Vladlen Tatarsky, was killed in an explosion at a cafe in St. Petersburg, authorities said. CNN's Matthew Chance reports.", "text": "1. How relevant is this ad to you?\n\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues", "image": "https://media.cnn.com/api/v1/images/stellar/prod/230402131233-01-russia-cafe-explosion-0402.jpg?c=16x9&q=w_800,c_fill"}, {"title": "Wall Street Journal reporter Evan Gershkovich appeals against arrest, Russian state media says", "url": "https://www.cnn.com/collections/intl-ukraine-030423/", "source": "CNN", "published": "Mon, 03 Apr 2023 13:58:58 GMT", "summary": "", "text": "", "image": ""}, {"title": "Suspected Chinese spy balloon was able to transmit information back to Beijing", "url": "https://www.cnn.com/2023/04/03/politics/chinese-spy-balloon/index.html", "source": "CNN", "published": "Mon, 03 Apr 2023 13:38:22 GMT", "summary": "The suspected Chinese spy balloon that transited the US earlier this year was able to capture imagery and collect some signals intelligence from US military sites, a source familiar with the matter tells CNN.", "text": "Washington CNN —\n\nThe Chinese spy balloon that transited the US earlier this year was able to capture imagery and collect some signals intelligence from US military sites, a source familiar with the matter tells CNN.\n\nThe balloon was able to transmit information back to Beijing in real time, the source said, and the US government still does not know for sure whether the Chinese government could wipe the balloon’s data as it received it. That raises questions about whether there is intelligence the balloon was able to gather that the US still doesn’t know about.\n\nStill, the intelligence community has not been overly concerned about the information the balloon was able to gather, the person said, because it is not much more sophisticated than what Chinese satellites are able to glean as they orbit over similar locations.\n\nA US intelligence official told CNN on Monday that “although analysis of the wreckage of the High Altitude Balloon remains ongoing, thus far, its flight over the United States does not appear to have provided critical new insights to the People’s Republic of China.”\n\nThe US also knew what the balloon’s path would be and was able to protect sensitive sites and censor some signals before the balloon was able to pick them up, officials have said.\n\nAs CNN has reported, the US intelligence community last year developed a method of tracking what it says is a fleet of these Chinese balloons operating across the globe, controlled by the Chinese military.\n\nThe FBI is still examining the balloon, but so far officials have been able to glean additional information about how the device worked, including the algorithms used for the balloon’s software and how it is powered and designed.\n\nCNN has reached out to the National Security Council at the White House and the Pentagon for comment. NBC was first to report on the new intelligence.\n\nVideo Ad Feedback Justin Trudeau on what the world needs to do to handle China's threats 01:33 - Source: CNN Justin Trudeau on what the world needs to do to handle China's threats 01:33\n\nThe balloon first crossed into US airspace over Alaska in late January before passing through Canada and down into Montana, where it hovered for a few days, leading the US to believe it was trying to surveil sensitive military sites, like Malmstrom Air Force Base in Montana. It was eventually shot down by the US off the East Coast on February 4, and the incident further escalated tensions between Washington and Beijing, including the postponement of a diplomatic visit by US Secretary of State Antony Blinken to China.\n\nA senior State Department official said in February that, as the balloon floated across the US, it “was capable of conducting signals intelligence collection operations.”\n\nGen. Glen VanHerck, the commander of US Northern Command and NORAD, said at the time that the US “did not assess” that the balloon “presented a significant collection hazard beyond what already exists in actionable technical means from the Chinese.”\n\nThe surveillance program, which includes a number of similar balloons, is in part run out of the small Chinese province of Hainan, officials told CNN. The US does not know the precise size of the fleet of Chinese surveillance balloons, but sources tell CNN that the program has conducted at least two dozen missions over at least five continents in recent years.\n\nRoughly half a dozen of those flights have been within US airspace, although not necessarily over US territory, according to one official familiar with the intelligence.\n\nChina has maintained that the balloon was actually just a weather balloon thrown off course, and the US has been assessing the possibility that it was not deliberately maneuvered into the continental US by the Chinese government, CNN has reported.\n\nStill, China did maintain some ability to maneuver the balloon, officials believe. And once the balloon was over Montana, China appeared to take advantage of its position to loiter over sensitive sites and try to collect intelligence.\n\nThis story has been updated with additional reporting.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/230211075054-chinese-spy-balloon-recovery-020523.jpg?c=16x9&q=w_800,c_fill"}, {"title": "'Scary, cold, hungry and lonely': Volunteer soldier shares experience on front line", "url": "https://www.cnn.com/videos/world/2023/04/03/soldiers-russia-ukraine-war-david-mckenzie-pkg-ovn-intl-ldn-vpx.cnn", "source": "CNN", "published": "Mon, 03 Apr 2023 12:13:24 GMT", "summary": "A young volunteer soldier, Akula, who signed up for the war at the beginning of the Russian invasion is now dealing with the trauma of war. He spoke to CNN's David McKenzie about his time on the front lines and how it has affected his mental health.", "text": "1. How relevant is this ad to you?\n\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues", "image": "https://media.cnn.com/api/v1/images/stellar/prod/230327100109-ptsd-soldier-ukraine.jpg?c=16x9&q=w_800,c_fill"}, {"title": "Russian authorities detain suspect over St. Petersburg cafe blast", "url": "https://edition.cnn.com/webview/europe/live-news/russia-ukraine-war-news-04-03-23/index.html", "source": "CNN", "published": "2025-04-15 13:46:06", "summary": "", "text": "A Ukrainian tank is seen near the frontline area amid the Russia-Ukraine war, in Bakhmut, Ukraine, on April 02. (Muhammed Enes Yildirim/Anadolu Agency/Getty Images)\n\nThe Ukrainian military has reported little change to the front lines but heavy fire from Russian forces at various parts of the front line in the Donetsk region.\n\nThe General Staff said that more than 45 enemy attacks had been repelled over the past day, with the focus on Lyman, Bakhmut, Avdiivka and Mariinka.\n\nIt said there were 17 air strikes and more than 20 strikes by multiple launch rocket systems.\n\n“In the Bakhmut direction, the enemy is trying to take full control over the city of Bakhmut and continues to storm it,” the General Staff said.\n\nWest of the city, Ukrainian defense forces repelled about 20 enemy attacks, according to the General Staff.\n\nOleksandr Syrskyi, commander of Ukrainian Land Forces, posted on Telegram that in Bakhmut he had met with “soldiers and commanders who destroyed the myth of invincibility of the Wagner fighters and Russian paratroopers.”\n\n“The enemy is weakening and trying to cover up its failures with new fakes about the capture of Bakhmut,” Syrskyi said.\n\nSyrskyi referenced the possibility of a future counter-offensive, saying that “the forward movement of our entire army depends on what every soldier is doing right now on their section of the front.”\n\nSome of the most intense fighting is to the northwest and west of the city of Donetsk – as the Russians continue months-long efforts to dislodge Ukrainian defenses in Avdiivka and Mariinka. The General Staff said that some 20 assaults had been repelled.\n\n“There are also some operational successes of our military in the Donetsk area. Our military have taken some positions. They have taken a more strategic and favourable position,” said Oleksii Dmytrashkivskyi, spokesperson for the military in that zone.\n\nHe also noted that Russian special forces had been introduced in the area.\n\n“The enemy is trying to attack our positions between Avdiivka and Marinka. These attempts do not stop. It should be noted that the enemy has suffered quite significant losses,” Dmytrashkivskyi said.\n\nHe also claimed that the Russians “don’t have the same amount of equipment and, as they themselves say, they are on a ‘diet’ of ammunition for assaults.”\n\nSocial media video showed both sides engaged in heavy fire in the Avdiivka area, which the Russians have surrounded on three sides.\n\nDenis Pushilin, the leader of the self-declared Donetsk People’s Republic, claimed that Russian forces were still advancing in the Avdiivka direction.\n\n“It is still premature to speak of encirclement, but the situation is being created, if not critical, then extremely difficult for the enemy… After clearing Kamianka, our units are moving further. There are difficulties both with the terrain, which must also be overcome, and there are also similarities with weather conditions. But these difficulties are mutual — both for the enemy and for us,” Pushilin said.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/230402121439-03-ukraine-counter-offensive.jpg?c=16x9&q=w_800,c_fill"}, {"title": "READ: Trump indictment related to hush money payment", "url": "https://cnn.it/411KYN7", "source": "CNN", "published": "2025-04-15 13:46:05", "summary": "", "text": "1. How relevant is this ad to you?\n\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues", "image": "https://media.cnn.com/api/v1/images/stellar/prod/230404161048-02-trump-indictment-unsealed.jpg?c=16x9&q=w_800,c_fill"}, {"title": "Trump pleads not guilty to 34 felony counts", "url": "https://edition.cnn.com/webview/politics/live-news/trump-indictment-stormy-daniels-news-04-03-23/index.html", "source": "CNN", "published": "2025-04-15 13:46:03", "summary": "", "text": "Then-President Donald Trump exits the Oval Office and walks to Marine One on the South Lawn of the White House in 2020. (Drew Angerer/Getty Images)\n\nDonald Trump will take America through yet another grave and unprecedented national drama this week when he becomes the first ex-president to appear in court charged with a crime.\n\nThe 45th president is expected to turn himself in on Tuesday in Manhattan, the stage where he built his legend as a brash popular culture figure and real estate magnate but which could now, in the case of “The People of the State of New York against Donald J. Trump,” engineer his downfall.\n\nIn what will be extraordinary scenes, Trump will return to New York after a grand jury voted to indict him last week in a case involving a hush money payment to adult film actress Stormy Daniels before the 2016 election. His appearance, accompanied by Secret Service agents, will come as he fires up his 2024 campaign for the White House. Trump plans to make a make a speech when he gets back to Mar-a-Lago on Tuesday night in which he will seek to leverage political advantage out of a perilous, personal legal crisis.\n\nFor many Americans who disdain Trump and his riotous single term, the case could be a sign that, finally, he is being called to account for his rule-crushing behavior and that everyone – even former presidents – are equal under the law. But Trump, using his bond with his most loyal supporters, is claiming the prosecution is a case of naked political persecution from District Attorney Alvin Bragg, a Democrat, that’s designed to thwart the possibility of a presidential comeback. According to fundraising numbers that his campaign is touting, Trump is getting a political boost from the attention.\n\nYet a criminal indictment takes Trump into unique political territory. And however the case turns out, his return to the spotlight in these circumstances is another twist in an exhausting saga featuring a double impeachment, false claims of a stolen election, and a mob attack on the US Congress during an unruly four-year presidency that pushed the nation to the point of exhaustion and deepened its polarization.\n\nSome legal experts, without having seen the still-sealed indictment, have questioned whether a case that appears to revolve around infringements of accounting practices and possible campaign finance violations is sufficiently serious to merit the historical step of indicting an ex-president who is already running again.\n\nAt the same time, it is ultimately Trump’s norm-busting behavior that pushed the country to this somber moment. He’s also being investigated over efforts to overturn the 2020 election result in Georgia, and by a special counsel probing his hoarding of classified documents and conduct in the run up to January 6, 2021, attack on the US Capitol. In several of these cases, Trump could face even more serious legal problems than in the Stormy Daniels matter, but that case is the only one so far that has yielded an indictment.\n\nTrump has denied wrongdoing in all of the cases. But once more, America’s political and legal systems, under a near-constant stress test since he came down the escalator in Trump Tower to launch his campaign in 2015, will be put under enormous pressure that is likely to only deepen the country’s internal estrangement.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/230331140346-donald-trump-230304.jpg?c=16x9&q=w_800,c_fill"}]}